{"meta":{"title":"三味冰淇淋","subtitle":"","description":"","author":"Dath Chou","url":"https://harlequinicecream.com","root":"/"},"pages":[{}],"posts":[{"title":"每个人都在自己的二十三岁痛哭","date":"2025-09-20T11:19:15.000Z","path":"2025/09/20/hurryupTomorrow/","text":"我喜欢冬天。虽然这一年种种讨厌的事情发生在了冬天，但每每想起，我还是喜欢冬天。 今天的故事不是有关冬天的，而是关于我的浪漫。 你有谈过恋爱吗，有没有过那种当别人问起是什么感觉，搜肠刮肚后只有答出一句“荷尔蒙的感觉”的幸福感？ 当风轻轻吹在你的脸上，像是天使尝试抚摸你的脸颊；当环境整体的温度并不高，带着些许步入冬天的寒冷，你会不会突然觉得此刻好浪漫，会不会想起你一生中的好多故事，仿佛他们都关联起来了？这样一个清晨，或是上午，或是下午，或是傍晚，或是深夜，会不会在你的脑海中久久挥之不去，好像你的一生，那些你未曾说出口的，那些你拼尽全力却难以结果的，那些你后悔也无从修改的，和那些你引以为傲的，那些你小有所成的，那些只留在心里给自己欣赏的，一同将你指引到了这个地方，在这个清晨，上午，下午，傍晚，或是深夜？ 那是一种超越恋爱般的荷尔蒙的浪漫，好像神明回到了你的身边。你感受到的是一种爱上一位超越世间所有存在的女神，一位只属于你的缪斯，是一种没有现实因素，一眼望到头的无尽的浪漫。 我会有。当天气缓缓入冬，或是慢慢回春，我总会在某一刻感受到这无边的浪漫。即使是在我这放声痛哭的二十三岁，我依然会爱上我的缪斯。即使在一无所有，没有财富，没有伴侣，没有灵感的二十三岁，我的缪斯依然会与我相依。她会将我从这二十三岁的困境中拯救出来，将我带至伊亚一个小旅店当中，我们坐在泳池边上，一其看着前方夕阳下的爱琴海。她将头靠在我的肩膀上，我们谁都不会讲任何一个词语，和这样一位女神在一起，连音乐都只是抄袭我的浪漫的累赘。我听到的只有夕阳照射在这为我们而停下的时间上的声音。 我与缪斯相识与一个上帝安排的巧合，任何听闻这个故事的人都会意识到这颗蓝色的星球其实只是一个很小的地方，其上生存的七十亿人只是一个谎言，不然怎会允许这般巧合的发生。她拥有着让任何陌生人只消一眼便能在多年后想起时仍称赞到“惊世骇俗”，却又绝非落入网络上那些万人追捧的俗套的美丽。但她的美丽并没有为她的人生带来更多的便利，而是像那故事中所写的一样，给她招致了更多的诽谤与背叛。更多的我也无从得知了，她心中总是有一块不愿揭开的阴霾，大概只是学生时代的无助，却也因此每次看进她的眼睛，总会发现一丝伤心。其实就连她所跟我讲过的那些过往，我也分不清哪些是真实的，哪些是她美丽的谎言。这样一张面容讲述着这样的故事，你只会陶醉其中。 这就是我的缪斯。这样一个在二十多岁的年级里，连痛苦都发不出声音的我的缪斯。我不知道我是谁，我什么也没有，我不知道我从何而来，我不知道为什么我会在这里，我更不知道我将去往何处。感谢我的父母，我大概有一些选择的权力，但我看不见这些选择的意义在哪里，看不见这些选择如何能让我更好，看不见这些选择能否给我带来我想要的。因为我甚至连自己想要什么也不知道。我看着所有不同于我的人，惊恐着担心自己变成他们的模样，小心翼翼的维护着自己心里那个比印象派画作更加朦胧的理想的未来。我什么都想要，我什么都没有。我会被一切问题击倒，而我的痛苦太幼稚，太造作，太琐碎，甚至都不知道该如何向他人请求一只援手。我会自鸣得意，觉得大丈夫生居天地间，岂能郁郁久居人下；安能摧眉折腰事权贵，使我不得开心颜。也会在面临选择的路口时自怨自艾，怨天尤人。除了我的父母，我无依无靠，没有根漂泊在这座不属于我的城市。 只有当寒风微微吹起，我才能躲进爱人的怀中。","permalink":"https://harlequinicecream.com/2025/09/20/hurryupTomorrow/","excerpt":"","categories":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/"},{"name":"生活","slug":"中文/生活","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/%E7%94%9F%E6%B4%BB/"}],"tags":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/tags/%E4%B8%AD%E6%96%87/"},{"name":"瞎写写","slug":"瞎写写","permalink":"https://harlequinicecream.com/tags/%E7%9E%8E%E5%86%99%E5%86%99/"}]},{"title":"2025都过了一半了","date":"2025-06-02T04:19:14.000Z","path":"2025/06/02/somebullshits/","text":"把你骗进来了，也骗到我自己了。因为其实根本不知道要写什么，只是刚读完伊豆的舞女有点感想，但好像又没处发。空间人多眼砸，微博还要和人对骂，被家访了更完蛋。写在博客上挺好，反正这里是我自己的空间，基本没人会看。（我安利给许多人过，但估计现在肯定没有人会翻了。罪己诏，也是因为我不怎么写博客，如果有人看到这里的话，给我发个消息，我请你吃疯狂星期四） Anyway，说回伊豆的舞女。我已经记不太清雪国写了什么了，但确实清晰的记得和伊豆的舞女一样，充满了“川端康成味”，自顾自的景色描写，自顾自的对话，结尾也是自顾自的打住了。我阅读量不够，日本代表性的作者没读过几本，但总觉得所谓日本物哀，大概指的便是川端康成的物哀了。太宰治和川端康成一直不对付，写的东西确实有人家的影子却又比不上人家呀。写的真的很有感觉，我很吃这一套。很难说我现在到底有没有形成一套自己的美学体系，总觉得“我喜欢什么”这件事，一直会被当下“我经历了什么”所干扰，但还是大言不惭的说一说，我就是很喜欢这套。看完伊豆的舞女，第一时间想到的是《那些忧伤的年轻人》，某种爱恋，某种失之交臂，某种爱而不得。大概是我总有遗憾，所以总觉得遗憾才是浪漫。 你也不知道为什么，故事里的艺人团们会对男主这样一个萍水相逢的陌生男子抱有这般的好感，可能是他帅，可能是他有钱，可能是他是大学预科生的公子哥，又大概是我被信息时代荼毒过深，总觉得这就是“故事总需要戏剧性”中那抹戏剧性的色彩。故事需要两人情意相投，于是他们便情意相投了。这大概就是我很喜欢的一点，属于我对现实的反抗。我的生命中大概少有这样的时刻，故事里我应该和那个女孩走到一起，但总是爱而不得；故事里我们应该有个美好的结局，但总有人走开。现实是无聊的史诗，我想至少文学里我应该反抗。然后故事继续流淌，男女主持续走近，一边又慢慢讲出其它角色背后的故事，都不是什么好事，但他们的生活又好像很快乐。所谓物哀不就这样，乐景衬哀情，告诉你他们多惨多惨，然后又给你看他们多开心多开心，你就会觉得他们多坚强多坚强，同时你自己就觉得多哀伤多哀伤。很老套，很管用，即使在这个信息爆炸，大伙什么东西多多少少都品鉴过的时代，还是屡试不爽，靠人心里最简单的淳朴狠狠地敲击着读者。 然后你就被川端康成带着走呀，像男主一样看着这些放在现代眼光下明明还是孩子的艺人团，在不受大众待见，自身也惨兮兮的环境下开开心心的活着，不知不觉就回到那个五子棋也能被当作消遣的时代了。你又看着男主，在爱情的洪流里漂泊，感受着那个女孩子时不时飘散而来的爱意，实在是有点爽，也全然不顾书中处处埋得二人身份不相称的伏笔了其实就是我没看出来，只想看到二人一起去看电影。当然最后没有电影，也没有二人幸终，物哀物哀，不哀不就落入了霸道总裁爱上我的俗套，到最后女主也哀，男主也哀，你也哀，才反应过来，在那样一个年代一个大家公子哥（虽然和川端康成的别的作品的角色一样，没有父母），怎么会和这么个人嫌狗厌的游艺团的女孩子在一起呢？这从超现实出发的故事终究是落回了现实，只得落下一声叹息。梦还是醒了，就像你的我的大多数人的生活一样，可能是爱情，可能不是，可能是青春，可能是某次机遇，可能只是生命中的某种可能性，总归汇聚于此了，和大家一样，和自己预想的一样，想说的话有很多，也只说一句可惜了。 说远了！其实我是很讨厌这种类似书评的东西的，感觉矫揉造作，对阅读的感受无以传递给他人。本来只是想聊聊读完后由自己向外散发的一些观点和感受，讲一些关于人生的分叉之类的东西，也想提及一下2666，却不知不觉写成了这样。我也要成为文艺逼了吧！哈哈哈。","permalink":"https://harlequinicecream.com/2025/06/02/somebullshits/","excerpt":"","categories":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/"},{"name":"阅读","slug":"中文/阅读","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/%E9%98%85%E8%AF%BB/"}],"tags":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/tags/%E4%B8%AD%E6%96%87/"},{"name":"瞎写写","slug":"瞎写写","permalink":"https://harlequinicecream.com/tags/%E7%9E%8E%E5%86%99%E5%86%99/"}]},{"title":"真的吗真的吗，我2024一年就写了一篇博客吗","date":"2025-01-16T23:59:06.000Z","path":"2025/01/17/whateverhello2025/","text":"那么我们直接开始2024的年终总结。（什么现在2025年已经过去两周了吗？我这边没有啊，应该是有时差吧。） 今天回头看才发现，原来我2024一整年真的只写了一篇博客，惭愧惭愧。虽然只有在嘴上说着惭愧，大概也很难有什么实质性的改变，但心里确实是惭愧得不行。明显感觉到自己越来越萎缩了，博客也不写了，书也不读了。这一年来我大概看了两本书，都是上一篇博客中提到想看书后买的，一本是波拉尼奥的《智利之夜》，在读到30还是50页的时候整本书不见了；一本是石黑英雄的《长日将尽》，这本书倒是没丢，随着我从9月坐了6，7趟飞机，终于是读到了第121页，回来后一眼都没有看过，只是每次打扫卫生的时候都要绞尽脑汁把它放到一个不那么碍事的地方。不要啊，好歹这个假期还是至少把它读完吧。 嘛，忏悔的话还是不再多说了，其实今年到澳大利亚读书后是有写过一篇博客的，主题大概是我的忏悔。是的，年中就在忏悔，年终还在忏悔。年中的那篇忏悔是在找实习被挂之后在半夜辗转反侧爬起来写的，写了个开头不知道该怎么继续往下写就回去继续睡了。当时想要忏悔的是自小以来的人生态度，大概是一种得过且过的正义，我从来只想“要什么”，而从不想“争什么”。在小时候有点小聪明，所以到迄今为止的人生还算好用，但好像到人生的这个阶段就不太好使了。在这里你想要什么你就得去争去抢，如果做不到的话就得想好自己在这样的现实下到底想要什么，能得到什么了。做割舍与妥协总是很难，很难不和别人比，很难专注于自身的安宁。 说回在悉尼的生活好了，毕竟这应该才算是2024的重头戏。虽然生活方面上来讲没什么不适应，但终归是自己一个人来到的异国他乡，没有什么朋友，在学校又总是遇到很狗屎的事，所以一度还挺抑郁的。我这个学期住在学生公寓里，很贵，但什么都很好，设施齐全，有人定时来房间做卫生，还有很多活动。作为第一个落脚点在这里我最先认识了一些朋友，有印尼人，有泰国人，有在越南长大的俄罗斯人，当然还有国人。但毕竟只是住在一块，又没有太多的共同爱好，所以更多也只是点头之交。我还是一个人吃饭，一个人玩游戏，一个人受着学校那群傻逼的气。 但还好，是有好运发生的。我在悉尼打万智牌的时候遇到了一个祖籍福建的大叔，他是澳大利亚人，中文基本不会说了，告诉我我的套牌很好，应该去参加现在正在举办的专业赛事。这个赛事每个星期都会在不同店铺举办预选赛，冠军可以拿到专业赛正赛的资格。为什么不去呢？反正周末也没有什么具体的事，花了那么多钱组的套牌不打也浪费。所以在这个比赛中我认识了一个中国人的小团体，有两个像我一样还是学生，不过已经在澳洲呆了很久了。有一个是广东人，移民来澳洲还在等pr，还有两个就是本地人了。他们第一次见我就说我打的很好，把我拉到他们的小群，拉我跟他们一起吃越南粉。所以后面在悉尼的日子就好过一些了，虽然学校里还是很操蛋，但周末就和他们一起打牌，打完一起去各种地方吃饭。有本地人带着真实在是太爽了，基本去的每个地方都很好吃。这点其实是和刻板印象不同的，其实在澳洲吃的非常好，世界上各个地方的人把自己那里正宗的料理带到这里，茶餐厅就是香港人开的，越南餐厅就是越南人开的，虽然日料大多数是韩国人开的，但都很好吃，说贵也贵不到哪去。非常幸运能遇到这样一帮人，让我在异国他乡也有志同道合，年龄相仿的朋友。下个学期我还要搬到去和那个广东人一起住，房间会简陋一点，但房租省下来一大半，又有人相互照应，真的很好。 新年快乐呀！是的写到这一段的时候已经是蛇年了，现在我已经记不太清楚去年的愿景是什么样的了，对新年抱有希望吗？今年我还是很抱有希望的，这一年也会是美好的一年，一切都会向好的方向发展。虽然好像我还找不到工作的样子，虽然现在已经在家里蹲了两个月，虽然对未来的一切都很难有所掌控。但没关系！一切都会好起来！降低预期，寻找真心，保持健康的身体与心态，一切都会好起来！以前从来不定新年计划什么的，今年开始还是有想完成的目标。有很多，想学唱歌，想日语进步，想当电脑维修学徒，想恢复阅读。这些应该都算是“可以的话，我会去做做看”，但有一个事，是希望自己无论如何都要坚持下来的，就是运动！希望自己保持运动，一开始想的是一周至少运动2次，尽量保持在3次以上，现在看来有点少，那就每周至少运动3次，尽量保持在四次以上吧！只有这一点怎么样都想要坚持下来，身体是革命的本钱啊，这段时间越来越觉得自己的健康，体质实在不是自己想要的样子。肚子上也开始长肉了，虽然体重好像半斤没长，但腹肌确实是看不见了T T把我的身材与健康都还来啊。 假期还剩差不多一个月，过完年立马就去日本玩，回来整顿一下又去成都准备回学校了。这之前希望能把很久之前买的那边日语听力做完，把《长日将尽》看完，把这篇博客写完。其实前段时间对于悉尼的生活好像还有点什么想说的，但一直被别的事情挤占了写博客的时间。写博客毕竟也是算写作的一种，总是要有心情，有灵感，有时间的情况下才能坐下来好好写点什么。真不是我懒。话又说回来，我在悉尼也才待了一学期，还有好多地方没去，好多快乐与烦恼还没体验，确实也说不出来什么东西，便作罢啦！就当帮我一个忙，让我完成这去日本前的一项任务吧，哈哈哈！ 下一篇博客会是什么时候呢？真的不好说哈哈哈，确实是懈怠了，十分惭愧，看看能不能做些什么。但也可能很快，毕竟又要去日本，回来说不定怎么说也写篇游记。你呢？我的朋友，你过去的一年还开心吗？有没有圆什么过去的遗憾呢？有没有什么没能实现的事情呢？新的一年有没有什么展望呢？今年OneRepublic登上了春晚作为新中国第一支登上春晚的乐队唱了一首《Counting Star》，借此将其中一句歌词送给你们，祝你们在新的一年里得偿所愿！再见！ I don’t think the world is sold, on just doing what we’re told.","permalink":"https://harlequinicecream.com/2025/01/17/whateverhello2025/","excerpt":"","categories":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/"},{"name":"生活","slug":"中文/生活","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/%E7%94%9F%E6%B4%BB/"}],"tags":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/tags/%E4%B8%AD%E6%96%87/"},{"name":"聊聊生活","slug":"聊聊生活","permalink":"https://harlequinicecream.com/tags/%E8%81%8A%E8%81%8A%E7%94%9F%E6%B4%BB/"},{"name":"年终总结","slug":"年终总结","permalink":"https://harlequinicecream.com/tags/%E5%B9%B4%E7%BB%88%E6%80%BB%E7%BB%93/"}]},{"title":"转眼间2024过去不止一半了","date":"2024-07-23T11:15:24.000Z","path":"2024/07/23/lalalala/","text":"这个这个，2024年都到七月底了，上一篇博客居然还是2023年的年度总结，说什么也说不过去了。私密马赛，虽然2024年以来一直还算是充实 （应该吧），但总归还是懒狗一只，我检讨。 那么我们来聊点什么呢，对半年进行一个总结？好像也没什么意思，天太热了，一从成都回到深圳，防线直接被击穿。太tm热了，不得不往空调房里躲，然后就暴了一身湿疹，痛苦不堪，在这种时候也没啥总结的心情了。随便写写吧，想到哪聊到哪，毕竟现在在香港机场，等着上去悉尼的飞机，在这种应该装裱起来的人生转折时刻，总还是会有点什么感想的。 总而言之，大学算是毕业了。从这两个词“总而言之”和“算是”应该能听出来，我好像对毕业这件事没什么概念。就像我在毕业致谢里写的，就算到了这个阶段，我好像还是对这个事情没什么概念。nice，既然说到了毕业致谢，那我就要把它放进来。大概会对其修改一下，但我真的很喜欢毕业致谢这个东西。比起两万字的论文正文，这个东西好像更能展现出我这四年的大学生涯更完整的一面。看着我的毕业致谢，我大抵就能想起这人生中不可磨灭的四年，想起大一为了追女生买的衣服，想起第一次去川西看过的星星，想起大二无限的失眠，第一次打达必妥时的绝望，大三在OPPO与北京的实习经历，和认识的那么多可爱的人（我今年又去了一趟北京，就为了看看他们还好吗），想起大四认识我可爱的宝贝，想起来她是怎样讲我从破碎的状态中拯救，想起我们一起欢笑过的那些日子。看到我将四年的成长与感悟浓缩成一篇致谢，感恩这个世界的同时感谢自己，我就会想起每一个人。 从这里开始，就是澳大利亚part啦。我已经在这边一个星期左右了，还挺开心的，口语交流也不成大问题，做饭技能也成长的还算快，并且意外的闲。总的来说过渡的还算顺利，语言也没有什么障碍。好像到这里了就觉得“Okay, let’s speak english now”也就切换过来了，并且口语水平恢复的也还可以，吃的也没啥不习惯，这里的炸鸡倒是意外的好吃，毕竟是白人传统美食。不过总觉得应该搞点书来看了，这段时间的阅读量实在是少的让人抬不起头，在京东买了点书等着转运过来，估计还得有个十几天。 前几天我住的学生公寓举办了个小型的奥运会观赛活动，活动上有个男生就说他们那边是夏天，我说地球上大部分国家这个时候都是夏天。从夏天飞到这里，身上皮肤难免有些不舒服，发炎，慢慢作息调整好后现在好了些。但我这个人，你也知道，一到冬天就会开始有点感伤，开始忆往昔峥嵘岁月，开始想起来一些过去的人和事，总觉得自己好像走的有点远了，不知道为什么自己就在这里了，在这条不舍昼夜的大河中间突然自顾自的停下。总是会感慨，啊大学四年就过去了啊，而我还是学生。我好像还不知道该怎么不作为学生活下去，好像那些曾经离我很远的东西现在离我还是很远，但那些我所曾熟悉的东西又在离我而去。我坐在这里，很丢脸的说，像个抓不住泡泡的孩子一样满怀泪意。想读书也应该是出于这般伤感，我应该能在阅读当中找到一些慰藉，亦或是让它帮我在这条悲伤的河流里推一下，使我可以于此慢慢流淌一阵。不知道该说什么了，就此打住，再说便是造作的为赋新词强说愁了。推荐一下波拉尼奥的《2666》，我最喜欢的两本书其一，文学中的文学，甚至可以说是我的伤感的具象化。好像我所理解的世界就是2666当中的那样，是一颗巨大的树，在无数个节点上分出无数的枝，你我都只是其中一柳，但又总是相连。无法看到世界的意义，但它就是如此磅礴有力，如此自由洒脱，如此，消沉又浪漫。 额啊，还是扯远了，还是说说这半年间做了些啥。翻了翻照片，大抵还是恋爱去了，旅游去了，见旧时友去了。参加了我表哥的婚礼，他爸爸，我的舅舅，那个时候在深圳打工，对我很好，给我买玩具，说话总是和和气气的。后来在工厂把右手大拇指砸断了，我还记得他用食指和中指从皮夹里把钱夹出来的样子。我已经很多年都没见过他们了，他们好像也没怎么变样，表哥还是那副不靠谱的样子，舅妈一见到我就给了我一个大大的拥抱，我觉得我都要哭了。虽然整个婚礼的过程我觉得俗不可耐，还吸够了近5年所有的二手烟，但舅舅看上去非常开心。那样就好了，我想，不管我们分散在何处，只要开心就好了。也去见了外婆外公他们，外婆肉眼可见的衰老了，三天两头住院，希望她能身体健康。外公嘴还是那么碎，不停的对我说教，让我不要喝饮料，说国家应该禁止生产可乐，这些人良心败完了，为了赚钱把人都害惨了。也去参加了爷爷八十岁生日，爷爷奶奶的身体倒是硬朗，每天活的都挺自在。表哥之前就结婚了，这次回去嫂子已经怀孕了，虽然完全看不出来。大大和大妈妈的手机店也和以前没有什么区别。我这里波涛汹涌的四年，在他们那里大抵更加平静吧。 我去了上海，去了北京，见到了那些在我生命中曾出现过的朋友们。有我的初中同学，高中同学，大学同学，牌友，同事，他们之中有的变样了，但基本都还是我认识的模样。我又去了日本，和我高中的好兄弟兼室友。在6年前我第一次来到日本时便是在京都一块，而此次我再次来到这里，再次吃到六年前曾吃过的拉面与抹茶，发现它们的美味竟不带一丝回忆的滤镜。我再次去到了金阁寺，伏见稻荷，与当年就已经认识的好友一起。我们跨越了半个日本，从关西一路走到鹿儿岛，去了更多地方，看到了更多的景，我想这就是我想要的“美”，一切安好又如初。 Anyway, 这篇就到这里吧，绞尽脑汁好像也写不出更多东西了。这段时间也还算忙，上完课就是做饭，但也有像这样闲的不知道做什么事的时候。买的书估计还得有几天才能从大陆运过来，就只能打打游戏消磨一下时间。就这样吧，晚点见！ 就算论文写到了这个部分，我也还是好像对“要毕业了”这件事没有什么实感，刚进大学的那个毛头小子居然一眨眼就要毕业了。没有什么办法，好像大学四年一以贯之的也就是这个主题，“没有什么办法”。但日子还是一天天过，致谢还是要写，直到现在我也记得大二某一天在食堂吃着铁板烧时构思自己毕业论文写致谢的那一天，好像我就是为这一天而存在的。 首先感谢的还是我的妈妈，她在她的那个年代用自己的努力与智慧为我创造了一个优渥的成长环境，让我有了面对一切都不卑不亢的自信。在我的成长过程中，如果没有她，在这个世界的精神体中就绝对不会有这样一个昂扬着，对未来感激涕零的期待着的小子。然后感谢的是我的父亲，虽然他不知道应该怎么让我感受到他爱我，但他仍然是个诚实的好人，在心底默默的爱着我。 随后感谢我的指导老师，在我的大学生涯中两次担任我的指导老师，对我的谆谆教诲将一生受用。感谢我的女朋友，四川大学的张生。十分感谢你在我大学的最后一年出现，我总是在说我要接受这失败的大学生涯了，但你的出现让我这绘制了四年的黑白图景有了色彩。谢谢你带我来玩，原来被爱的世界这么精彩。 感谢我的朋友们，有自初中就相识的费**，吕**，张*等；高中同学的罗**，郭**，张**，罗**，聂**，张**，张*等；大学里朋友就有点少了，尹**，李**，邓**，曾**，何**，代**等。以及我从小一起长大的发小林**，小时候总不会写你的名字，现在不用手写了。还有很多很多人，如果有人因此气愤为什么你的名字不在这个列表当中，请接收我最诚挚的歉意，受之有愧受之有愧，在长大的过程里我总是能收到太多的善意，以至于不能在此完全罗列。我是个偏执且不知轻重的人，能和你们做朋友是我的荣幸。生活中我觉得自己总是很倒霉，大抵运气都用在遇到你们上了。所有知道我名字的人啊，你们好不好？ 感谢电子科技大学信息与软件工程学院，感谢我们年级的三位辅导员，滢姐，琳姐，周哥。四年以来我总是毛病不断，三位辅导员悉心地照顾着每次事发时麻烦的我，不仅耐心回答我的每个问题，还总是帮我做一些流程上麻烦的事情，甚至批准我在封校期间出去看《神奇女侠1984》，感激不尽。 感谢这个世界！感谢马克思与恩格斯带给我们的思想财富，感谢在这个世界上努力着的所有人民们！这个世界是属于你们的，是属于我们这样埋头苦干，沉默着努力着的父母、子女、老师、学生、伴侣、农民、程序员、环卫工、演员、医生、建筑师、厨师、警察、销售员、艺术家等等劳动者的！因为有你们，世界才是这般的五彩斑斓；因为有我们，人类的伟大才总是可以被赞颂！ 最后，感谢我自己。虽然四年过去，身体健康变得摇摇欲坠，也没有申请到想要的高校研究生，但你看看，现在你想吃麦当劳就可以吃麦当劳，想唱歌就可以放声大唱，你小子还真是了不起啊！你在大学里那么努力，学了这么多东西，又见了那么多人，去了那么多地方，干了那么多事，又成为了一个更好的人，你真的做到了！ 谢谢诸君，一路看到了这里，这样你们也好似和我一起走过了这也无风雨也无晴的四年大学生涯，因为有你们相伴，我才总有勇气说自己在这冰天雪地的人生当中，总能感受到春风的吹拂。那么，男子汉崔思惘又要转身迎接新的章节了，祝愿命运的长风伴其左右。读者们，再会了！倘若一命尚存，我们来日再会！请带着勇气向前走！切勿绝望！那么，失陪了。","permalink":"https://harlequinicecream.com/2024/07/23/lalalala/","excerpt":"","categories":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/"},{"name":"生活","slug":"中文/生活","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/%E7%94%9F%E6%B4%BB/"}],"tags":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/tags/%E4%B8%AD%E6%96%87/"},{"name":"聊聊生活","slug":"聊聊生活","permalink":"https://harlequinicecream.com/tags/%E8%81%8A%E8%81%8A%E7%94%9F%E6%B4%BB/"}]},{"title":"ありがとう2023、そして、また。","date":"2023-12-20T10:52:15.000Z","path":"2023/12/20/ilove2023ireallydo/","text":"嗨呀！好像每当我不知道怎么开始的时候，就会来句“嗨呀”作为开场白。大概也挺合适，一年要结束了，万物在寒风中迎来完结，忘却过去365天的喜怒哀乐，这种时候还能说些什么呢？想来想去，还是叹一声“嗨呀”吧，千古多少事，一付笑谈中。 现在想来2023年也太好了，我有多久没说一年是好的，甚至只是说这一年没那么糟糕了呢？我记得高二那年的一句“回顾今年，实在是太苦了，太苦了。以至于我只是一回忆今年的种种，就忍不住哭诉一句，太苦了”开始，好像就撞开了苦涩的大门。年复一年，痛苦与悔恨接踵而来，从心理上的痛苦上升到了生理上的痛苦。现在想想20年应该还算是不那么痛苦的，高三下学期我也没什么压力，每天乐呵呵的，高考也考的不错，大一上还对大学生活充满着期望。虽然毕业旅行消失了，虽然身上皮肤好像结成鳞甲，开始注射达必妥，但总归，在这几年间算好的了。 扯远了，2023年是从解封的希望中开始的，当时我还在OPPO实习，虽然LD总是给我些完全不知道如何下手的任务，但总归是比较轻松的，每天摸鱼摸到累，还在上班时间下去逛商场。当时就觉得，好像一切都不一样了，每个人脸上都有了生气，商场的空气也不再沉重了，所有人都知道，有希望了。 在刚放开初阳的那一大波里我算是阳得晚的，公司里我这一层都快没人了，我也坚持到最后一天上班。我一直以为可能我真有什么奇怪的抵抗力，直到当天下午坐我对面的大叔突然开始乱动，然后说好像有点发烧，一测38度。次日我去电影院看了海贼王的最新剧场版，主题也有关新世界和希望，当时觉得真好啊，一切都在暗示着我，要好起来了。随后一出电影院就觉得不对了，回家倒头就开始发烧，烧了个3天，靠磕布洛芬续命。 随后就FuckOPPO了，焦虑了一个月，疯狂找下家实习，最后跑到北京美团去了，然后就FuckMeituan了（草）。说是这么说，其实最大的问题还是身体问题，三天两头跑医院，二阳，失眠，自费达必妥啥的。虽然在美团待得不开心，也没什么福利，天天骂王兴，但还是比较轻松的。两周一个版本，一周开发一周测试。我入职一周那个Sb leader就让我上手开发需求，奈何爷能力够强，第一个需求之后我两天就能开发完，剩下三天打开一个装模作样的文档，然后开个小窗口在左下角看直播，每天又是摸鱼摸到累。还认识了几个朋友，有大叔（还是我同事），有差不多同龄的研究生，到处去玩去找同学，每个月工资也不少。现在想想那段时间还是挺不错的，就是身体太差了，果然健康才是最重要的啊！ 从北京回来后在家里待着，一天到晚没事做也算安逸，如果我妈不跟我爸吵架就好了。就在我写这篇博客的现在，又是和上次吵架前一模一样的场景，希望这次别吵了，求你了。 在家没待多久就去日本玩了，实在是太开心了，以至于在这里想不出什么合适的词语来总结，去看我那篇おかえり的博客吧。 就越多回到学校，军训期间字节跳动的HR给我发邮件问我要不要面试，我想着面着玩玩就去了，没想到那边特别缺人，我随便面试一下就直接放我进了，但我根本没打算去的，主要是因为工作地点在北京，当时身体又很差，我怕去冬天的北京之后直接长眠在那里了。那个HR小姐姐诚意真的很足，说可以加面一轮直接走正式工流程而不是实习，甚至问我如果北京不行的话愿不愿意去重庆办公（虽然后面又说还是做不到）。最后还是拒绝了，好可惜啊，虽然事情已经发生了，拒绝也是深思熟虑的选择，但还是很难不觉得惋惜。 当时是什么情况呢，因为失眠一直不得好转，连去日本时都时不时严重失眠，所以决定去华西医院看看医生，看有没有什么治疗方法。挂的号是五级专家的，提前十四天抢的号，结果一去就问我一堆垃圾问题，我一要说自己的情况就打断我不让我说。然后就去做那些没用的测试，我都不用看结果就知道测不出来什么东西，然后就开安眠药，一套下来只觉得浪费了时间。这就是中国的心理健康学科。 如果只是浪费时间和感情倒还好，她给我开思诺思，最新一代的安眠药，我吃了后第二天全身乏力，困，像是魂都被抽走了。但我当时还没意识到这是药的副作用，因为网上对这个药的评价也很高，说是基本没什么副作用，吃了就睡，醒了就正常生活。但我的副作用就很大，我就这么每天吃，连续吃了5天，萎靡了5天。终于有一天不失眠了，没有吃药，第二天醒来神清气爽，但没过两天又失眠了，于是又开始吃药，那种魂不守舍的感觉就又回来了。我终于意识到，我吃不得这个。停药当天晚上开始心悸，突然就觉得很孤独，听说这个药可能诱发潜在的抑郁症倾向，当时真的吓死了。还好过了两天就不再出现那种感觉，回归正常了。 现在想来，如果当时被OPPO踢掉后没有再找下家，就不会去北京，也许身体就不会这么差，就顺水推舟去字节跳动了。故事能这么讲吗？我不知道，但那样我大概率也认识不到这些北京的朋友，身体不会像现在这样好转，也会错过我的女朋友。在这种路口，虽然命运的车轮滚滚过，但还是很难不会产生这种念头。故事会发展成这样吗？如果蝙蝠侠杀了小丑，如果一百单八起义成功，如果我当时这样这样，会更好吗？ 这一年总体来讲真的是喜出望外的好了，实习上班的时候也轻松，玩也没少玩。虽然健康状况十分糟糕，但在年末总算是要好起来了。这一年间我不甘地挣扎，挤破头要进大厂，但最后又亲手放掉了梦寐以求的offer。刚进大学的时候想要去美国，去那个码农遍地年薪20w刀的地方，却又不知怎的慢慢滑向了加拿大，觉得就在那边赚点小钱安安稳稳地过就好。但加拿大的大学语言要求卡得过于离谱，能够得着要求的都是一些堪称“野鸡大学”的大学。所以现在的考虑是去澳洲读个点击就送的高排名大学，然后试着也许留也许不留，最后到日本去，到那个极度缺人，但工资又不高的日本IT行业去。 所以我一直在说啊，一直在说，我要接受我的失败了。我的大学生涯一路看下来，确实可以说是失败的，除了喜怒哀乐，什么也没捞着。成绩成绩不高，申请申请不好，身体还被自己搞得半死不活。想起来在北京打牌认识的大哥说的一句烂俗话，人就两只手，不放下点什么，是拿不起新的东西的。如果大学这三年我能放下一些执念，专注于一个目标，会不会有更好的结果呢？就像是把实习的精力拿去刷语言，也许申请学校的选择就会更好。但其实我已经有很好的出路了呀，如果现在真的去找工作，虽然很痛苦，但我相信肯定能有还不错的出路。这么说来，怪我贪心吗？大概真的是有点贪心吧，但你又怎么能怪一个少年贪心呢，二十岁啊，正是觉得自己能把全世界操翻的年纪。但真要说起来，我又哪里有多贪心呢？我一直没变过要离开这里的想法，努力实习也是给以后在外面找工作铺路，但命运好像不愿意给我那么多，塞给我一个足够好但我却不想要的蛋糕，告诉我“来，你的努力有了回报”。我一脸不可思议地看着命运，又只能默默把它送回去，告诉他“我还没有要就此停下”。大概明明世界上只有必然吧。 谢谢诸君，一路看到了这里，这样你们也好似和我一起走过了这春天般的2023年，因为有你们相伴，我才总有勇气说自己在这冰天雪地的人生当中，总能感受到春风的吹拂。那么，男子汉崔思惘又要转身迎接新的章节了，祝愿命运的长风伴其左右。读者们，再会了！倘若一命尚存，我们来日再会！请带着勇气向前走！切勿绝望！那么，失陪了。","permalink":"https://harlequinicecream.com/2023/12/20/ilove2023ireallydo/","excerpt":"","categories":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/"},{"name":"生活","slug":"中文/生活","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/%E7%94%9F%E6%B4%BB/"}],"tags":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/tags/%E4%B8%AD%E6%96%87/"},{"name":"聊聊生活，年终总结","slug":"聊聊生活，年终总结","permalink":"https://harlequinicecream.com/tags/%E8%81%8A%E8%81%8A%E7%94%9F%E6%B4%BB%EF%BC%8C%E5%B9%B4%E7%BB%88%E6%80%BB%E7%BB%93/"}]},{"title":"おかえり","date":"2023-08-20T11:46:48.000Z","path":"2023/08/20/ohmylalaland/","text":"去日本也算是蓄谋已久了，本来高三毕业旅行就想去日本，当时打算的是去北海道，去青森看太宰治故居，再南下到东京玩个满打满算十五天，攻略都做好了。但我高考在20年，所以，你懂的。这次去日本本来是想去大阪环球影城，玩海贼王联动的，但定的很匆忙，机票买成了东京往返，加上环球影城的快速票已经给炒到天价了，就只能留点遗憾下次再来了。说是九天，实际也就玩了七天，剩下两天都在赶飞机，这七天日均两万多步，回来就歇逼了，把拍的照片录的视频导一导，也写点什么记录一下。我实在是太喜欢这个地方了，中间两天甚至喜极而泣，好像身体里已经装不下更多的喜悦与幸福感，以至于必须化作眼泪流了出来。 btw，我也不知道我到底想要产出一个怎样的博客，所以可能突出一个随心所欲。在基于hexo的博客上放图还添麻烦的，所以可能有图也可能没有，有些地方可能很抽象就带过了也可能讲的很细，敬请谅解。 Let’s goooooooooooooooo~从香港出发，坐的是不太廉价的廉价航班，下午两点的飞机，早上八点就得出发，过关，转两次车到机场，上飞机，飞四个半小时，途中没有任何吃的喝的提供，连毯子也要180港币。然后就到日本了，就是这么简单，虽然有点累，你还是就这么踏上了另一片土地。很难评价日本是一个怎样的地方，怎么说都好像不合适，但我还是想说，这是一个很迷人的小岛。 说是这么说，下了飞机后就遇到了在日本这九天一直困扰着我们的最大的问题：日本的铁道交通。日本的铁道虽然称得上四通八达，但却不像中国这样由政府统一经营，所以简单来说，非常的复杂。在谷歌地图上导航到机场的换乘方案在线下一条都找不到，最后在不太懂英文的大叔给不太懂日语的我一通指点后，跌跌撞撞地到了位于浅草桥的旅馆。到的时候基本已经是十二点了，匆匆休息，期待着明天的行程。 尝试描述一下日本铁路。因为日本铁路有多家在运营，所以在换乘的时候基本都要先出站再进站。并且很多时候一个站贼大，有四五条线可以换乘，人又多，对初来乍到的游客确实十分有挑战性。如果你有幸要坐JR的话呢就更有趣了，有些线路得提前买票，不然就得站两三个小时，或者选择更晚的班次。并且JR一趟要买两张票，一张是站点之间的票，相当于不管你是怎么从这一站到目的地，你都得买这张票，而这张票可以通过刷西瓜卡来支付。第二张票是坐JR额外要给的钱。在网上预约车票也是这么玩的，你可以选择只买第二张票，第一张票刷西瓜卡就行。但我只是个游客啊，也太tm复杂了。 第一天上午去了浅草寺，属于是网红景点中的网红景点。还是可以的，很有感觉，但人确实太多了，逛得有点烦躁，这个地方就不细讲了，随便搜搜哪都是评测。下午就在旁边的隅田川一带逛，远远地看了东京晴空树，然后突然发现一个好地方：葛饰北斋的出生地，在那里有一个关于他的博物馆。如果你不知道他是谁，那你也肯定看过那副《神奈川冲浪里》，于是我们便往那边走去。当天太阳还算大，但又不热，反而时不时突然下起大雨来。雨实在太大时我们便站在路边人家的屋檐下躲雨。妈妈说这是何等的缘分，我们飞这么大老远到这户人家屋檐下躲雨，按日本人的习俗应该把我们请进去招待我们喝茶。那户人家的门牌写着松上还是哪个，反正是个日本大姓，可惜记不清了。葛饰北斋的博物馆可是有意思，我一般都对类似的美术作品人物生平不感兴趣，这次却逛得额外起劲。据介绍说，葛饰北斋四处游历，画了日本境内的各类群山（再详细就记不得了T_T），欣赏起来确实能感觉到山的壮丽与人山共处的惬意。他还画了很多日本的鬼怪形象，百姓生活等，但都没有他的山水画知名。第一天下午大部分时间就在这里度过了，离开时还买了张明信片走。本来晚上想上晴空塔的，但雾实在是太大便作罢了，倒是去了秋叶原一逛。妈妈一定要跟着，所以也没法好好享受哈哈XD。基本上确实和网上说的差不多，并且很多原神。第一天比较简单，就不单拎出来一段说完好了。 松本，诹访，你的名字和花火大会第二天便启程去了松本，这是一个日本中部的小城，坐新干线三个小时才到，日本的新干线的每个座位顶上会有一个灯，红色表示没有人坐，那些买了站票的乘客就可以坐，黄色表示现在没人，后面的站会上人，绿色就是一直有人坐，很方便。我们去的时候因为没搞懂网上买票为什么有两个价格（也就是我前面简单介绍的部分），所以只得去线下用我的三脚猫日语买票，也就没赶上计划的出发时间。不过好在这班新干线一个小时就有一般，我们便买了下午一点的票打算吃了饭再去。上午便在新宿街头逛了逛，新宿的街头很有特点，也很有意思，有点像香港九龙，给人感觉晚上应该是个有点乱的地方。有着更多的花花绿绿的招牌，但又蕴藏着那种“日本式”的秩序井然，不论如何，你一定会觉得这是一个很有趣的地方。 不过到最后我也没去传说中的歌舞伎町一番街，看来又要留到不知道多久以后的下一次了。 一下新干线进到松本站内就能看到各种给游客的帮助，专门给游客的咨询处，各种旅游地图景点介绍，什么语言都有，并且人流量也不小，俨然一副旅游城市的感觉。但其实城市不大，也没有太多出圈的景点，车站周边就是最繁华的区域了，再走个十分钟就俨然一副三四线小城模样，没有高楼大厦，家家户户都是一户建，当然，天也很蓝。 当天的下午我们去了被称为国宝的松本城，基本上就是那种古代将军的城堡。当时已经五点了，看外面的宣传资料说已经关门了，但我们到正门一看却还是开着，也就买了票进去参观。人不算很少，但也没排很久的队，是一个很舒服的适中感。城堡里面都是木质结构，摆的都是以前战国时达的各种武器，盔甲之类的，介绍只有日语和英语，匆匆看过便过了。在城楼里面的楼梯附近严禁拍照，我和妈妈都猜是因为那个楼梯很窄又很陡，人又很多，担心出事。不过这个规定执行着执行着就变得很机械化了，因为我只是把相机固定在肩带上录像都被他们发现，让我关掉。在最高层可以俯瞰松本市，也能看到远处的群山，如果不是战争，在这种地方住着也算是皇帝待遇了吧。 下了松本城后已经六点了，再去了旁边的绳手街，街边的商铺就都已经打烊了，松本的荞麦面很有名 ，我们弯弯拐拐地到了一家庭院一样的餐馆想吃荞麦面，却发现也挂上了“荞麦面已售完”的牌子。于是我们往车站那边走，又发现一家评分不错的荞麦面店，但门口的长队看上去已经不是能排到的了。当时其实才六点过，但街上已经没多少店铺还开门了，我们决定如果过一会再找不到荞麦面吃，就去吃刚刚看到的鸭汤拉面。不过后面我们还是在隔了一条街的地方找到一家荞麦面店，和之前排长队的店是同一个牌子，却没什么人排。其实我对荞麦面没有太大的喜好，觉得它没有特殊的口感也没有奇特的味道，但吃起来也不差，有股淡淡的麦香味，沾着茶杯装的酱汁吃起来咸淡正好，也很有日本特色。我觉得最好的是那里的天妇罗，我一直觉得日本的天妇罗做得更好，我在国内没有吃过这样的天妇罗，不是里面的食材太拉胯就是外面的面浆不合格。日本的天妇罗除了里面的食材外，其裹在外面的面浆也是主角，不会太厚也不会太薄，通过面的香味辅佐里面的食材，相辅相成而又不喧宾夺主。妈妈吃的热的鸡汤荞麦，汤也很香很好喝。 吃完饭街上就基本已经没有什么店铺开门了，不过才八点，却好像这座城已然睡去，街上也只有零零散散的人。我们往回走，走到松本城那块后发现那里在举办为期三天的“第75届城市舞蹈节”，一个不大的方形舞台上面年轻人跪在中间敲鼓，老人围成圈重复着一个舞步，下面的看客们也有样学样地跳着。我没有跟着跳，只是一直看着，心里觉得真好啊。 第三天就出发去诹访了，期待晚上的花火大会。诹访离松本很近，一开始计划行程的时候本来没想着要来松本，但就是因为诹访湖的花火大会当地的所有酒店基本都订满了，松本又是离诹访最近的规模稍微大点的城市，于是我们就住在松本了。 在诹访也只有短短大半天的行程，主要还是围绕着诹访湖展开。下了电车后我们先去湖边转了转，湖边已经架好了围栏，因为里面是付费席位要买票进入。这个票差不多提前半年就开始在线上抽选了，我做攻略发现有这么个花火大会的时候已经全部卖完了，按网上的说法，可以去当地的便利店碰碰运气。但这场花火大会是时隔三年终于再开的花火大会，好像规模也是数一数二的，票自然是早早售罄了，我们沿着湖边问了一圈也没有结果，只能作罢。我们又在周边逛了逛，但绝大多数可以作为景点参观的地方都因为晚上的花火大会而不对外开放了。我们便去找了一家手作寿司店吃饭，里面捏寿司的是个老爷爷，看上去像是一家人经营着这家小店。寿司的饭团里米醋用的很足，以至于蘸着酱油吃都会觉得太闲，空口吃反而正好。这种自营的小寿司店价格会比那些连锁店更贵些，适合三两好友约着来这里点一客，边喝啤酒边看着店里的老式电视说说笑笑。 简单介绍一下当时场地是个什么情况。圆形的诹访湖把诹访分为上诹访和下诹访，我们在上诹访这边，并且所有的活动信息都是在上诹访这边的，所以湖对面的情况不了解。湖边是公园，已经给围栏围起来了，只有有票的人才能出入。但围栏外面的马路也不让车走，全部提供给行人，日语称作“步行者天国”。所以在马路上铺个垫子也是能看到烟花的，只是可能效果稍微差一点，到晚上真正开始的时候马路边上也差不多都坐满人了。 吃完饭我们就往山上走，山上有个立石公园，从那里可以很好的俯瞰诹访湖，我们便一路往上走，发现这里也不让车过了，看来晚上这里也会是一片盛况。果然，从公园往下看湖视野真是无与伦比，传闻这里就是《你的名字》里糸守湖的取景地，从这里一看大抵果真如此！当时才下午两点左右，便已经有了好些年轻人在这里铺好了防滑垫放好了零食饮料等着晚上的花火大会了。当时天气还处于阴一阵晴一阵的阶段，台风刚好过境，这里处于台风圈影响刚刚好外面一点的位置，所以一直在担心晚上的花火大会会不会因为雨太大而取消。幸好幸好，到了傍晚已经一点雨都没有了，有一点冷，但令人无比心安。 话又说回来，到底是什么把我引到这来的呢？固然是《你的名字》以及刚好时间匹配的花火大会，但其中还有一个很重要的，令人伤心的故事，不知道有没有机会讲出来了。 下了山后我们在湖边找到了一块地方，应该和别的政府经营的区域不同是私营的，告诉我们还是湖边的位置可以坐，但要11000日元一个人，折合人民币550块左右。妈妈说都花这么多钱来这里了不差这点，于是我们便买了票，找到了看烟花的地方。我们在位子上休息了一会，又去看了那里的高岛城，和松本城很像，不过小了一些，也不那么有名。城楼本身因为花火大会人太多已经关了，城墙内的花园倒是有好多家长带着孩子玩游戏，看他们的样子应该是本地人。这里很安静，仿佛四周的围墙真的把外面和里面隔绝开来了，外面的喧嚣与里面都不再有关。 最后就是万众期待的花火大会了，我们去人挤人的便利店里买了晚饭，我要了一碗咖喱饭，妈妈要了两个三明治，就坐在位子上边吃边等。花火大会官方直播回放放在下面，长达九个小时，拖到后面看就行,也可以自己搜搜相关的剪辑，主要是在油管上，b站上好像不太有。到了这最大的重头戏，我反而说不出什么感想了，实在是太美好了，就只是放烟花这样简单的事，居然就会让这么多人集聚一堂，共享此般美好与感动，虽然很不想承认，但现在国内又何时有这样的时刻呢。我的幸福感好像已经无法再被拘束在我的身体里，只能化作眼泪从身体里流出。 【ライブ配信】第75回諏訪湖祭湖上花火大会 (YouTube) 没有拍的很好，随便放两张照片好了。 第四天我们一大早便坐公交上山前往松本周边的上高地，这个地方好像还算出名，是一个自然公园般的景点。但在车上的时候外面就已经一直是阴雨状态了，在公园里逛得时候更是直接大雨滂沱。我本来就不喜欢雨天，鞋子更是不超半小时就湿透了，山上全是雾，也看不见什么远处的山峰，我一路走一路抱怨，最后一到停留点我们就坐车下去了。（可以一路往上走，有好几个小的景点，都设有车站和歇脚的停留点。）十分后悔。如果你是和别人一起去旅游，一定不要这样烦躁抱怨等，问就是十分后悔。 本来安排在上高地玩一整天，结果中午就下来了，于是下午我便找了个一直挂念想去看看的日本网吧。传闻日本网吧甚至可以当酒店来住，里面非常安静，提供免费的饮料，提供一个独立的包间，不大但可以直接躺着睡在里面，还有饭卖，可以洗澡洗衣服，甚至还比较便宜。那么实际情况如何呢？完全准确，连一点偏差都没有，可能较少提到的是两点：一包厢里的电脑配置非常烂，基本上只能开一两个网页，再多干点别的事就会卡，网速也不快，就别想着打游戏了；二是网吧会有好几个架子的漫画给你免费看。这其实都是因为本质上日本的网吧都叫做“网络咖啡店”，是一个给你放松看漫画的地方，所以电脑配置也就够你看漫画就得了。还是很舒服的，两个大自动贩卖机给你免费喝饮料，可乐奶昔可可茶什么都有，又很干净很安静，待一个晚上才一百多两百人民币，在日本可找不到这么便宜的酒店。本来我想去把相机里录得视频都传到网盘里，可甚至不说网速怎么样，连读写速度都完全不够用，就只能作罢，喝喝免费的饮料看看日本漫画杂志就溜了。 回到东京第五天告别了松本这个过于讨人喜爱的小城，回到东京，第一站就是富士山。久闻富士山大名，在做攻略时却一直举棋不定，感觉只在河口湖一个地方填充不满一天的行程，还准备了几个周边景点。但其实一天被塞得满满当当，还差点没赶上回新宿的新干线。从松本回到新宿，已经是中午了，我们直接转车到河口湖站，一路上我一直在寻找方向尝试着在车上就先看上富士山一眼，却怎么也看不见，只好作罢。到站后我们找了个投币储存箱存行李，就准备轻装上阵出发去河口湖了。河口湖站和河口湖还有一段距离，在河口湖站开设了三条不同的环游巴士路线，我们选择了最简单的红线，这巴士的速度实在是太慢了，就一点距离得晃晃悠悠半个小时，我们在中间下车了，想要坐索道上山，这个地方听说是看富士山的圣地，从山半坡看富士山的同时可以俯瞰河口湖镇。然而当天不仅时不时有雨，还在打雷，索道直接停了，挂上了“不确定什么时候再开”的标牌。不是前文说过吗，一下雨我就会非常烦躁，再加上富士山这么有名，周边全都是带着小孩的中国人，吵得让我想起很多以前去过的体验糟糕的国内景点，心情又不是很好，一直抱怨我真的知道错了。最后到了下午两点，我们终于到了河口湖旁边的公园，守得云开见日明，天气也终于放晴，得以窥见富士山尊容。 不得不说，亲眼看到富士山后，确实可以理解为什么它可以在群山耸立的日本脱颖而出成为百山之首。真的十分标致，一个漂亮的山大抵就应该是这样的，挺拔，俊俏，山体的弧线没有一丝犹豫地往上延伸。并且当时正好雨过天晴，天空很蓝，虽然云还多了一些，但也有时候可以看见富士山全貌。终于，压抑一天的心情一下子舒缓开来，前面一路的坎坷都是对我的试炼，只要不放弃保持好心情，一定能看见富士山。 入戏一下，这里说的“一定能看见富士山不是指狭义的富士山，是指所有坚持后如愿以偿的事物，就和彩虹总在风雨后一样。 我们在拍照的时候还遇到个大哥，四处找人帮他拍照，我们都在猜它是哪人，结果一问居然是蒙古的。我跟他说我们是中国人，他说了一句“我们之间有很多故事”。后面天就又开始变阴了，富士山也慢慢看不清了，我们就往回赶了。到了河口湖站却发现，回程的大巴都已经没票了，最后一班新干线也卖完了。只剩又贵又慢的本地列车。但我突然想到，既然新干线上有座位指示灯这么个东西，那么肯定是可以买没有座位的站票的对吧？我一问得知票价都是一样的，可以买但你得站三个小时全程，除非中途能找到空的位置。当然最后我们买了站票，想着站三个小时就三个小时吧，结果运气不错，没到一半路程就有一对夫妇下车了，我们得以坐着回到新宿。 第六天。眨眼睛在日本的日子就要结束了，说是玩九天，有两天完全在路上，实际在玩的也只有七天而已。前一天晚上我的失眠又犯了，所以上午去上野公园时整个人都是蔫的，并且当天太阳又很大，我逛了没多久就先自行回酒店睡觉了。上野公园确实很值得一去，够大，历史悠久，可以玩的地方也很多，要仔细玩一遍的话估计能塞满一天。可惜我逛了没多久就回去了，让妈妈一个人在那边玩，后来听她说感觉她很开心。 中午回去再睡了一会，精神有所好转，中午趁妈妈还在上野公园，我去须贺神社圣地巡礼了一番，就是《你的名字》里最后的最后男女主相会的那个楼梯，在现实中的原型楼梯上就是这个须贺神社。这个地方还有点难找，日本很多这样隐藏在建筑群当中的神社之类的，我到的时候就已经有三五对人聚集在楼梯脚下，都是年轻人，肯定都是像我一样来圣地巡礼的。简单拍了照后我就向上走，来到这个须贺神社，日本的神社都会设有几块很大的板子，你可以向神社购买一个五角形小木板，日语叫絵馬，然后把自己的愿望之类的写在上面，最后系在大板子上以祈福。须贺神社的祈福板系的绘马上基本都是《你的名字》相关内容，有写字的有画画的，看来即使七年已经悄然飞过，好的作品依然存在于世界各地的人心当中。 既然有这样一个向上的楼梯，须贺神社自然是处于一个较高的地势，它的周边其实还有很多家族所属的寺庙一类的建筑，我也不太懂，只觉得这一块给人感觉非常好，安静又整洁，仿佛真有什么神明于此。如果被选中是这块区域而不是那个楼梯，肯定也会成为打卡的圣地，但现在这里一个游客也看不到，连本地人也只能时不时见到一个，就这样在此地一如既往地独自安静下去。大抵这就是人生吧，我想。 告别须贺神社，就前往东京晴空树与妈妈会和，上次因为天气原因没有上去看，这次天气十分理想。我们先在下面的商城好好逛了一下，发现了很多之前没有逛到的地方。有卡比餐厅，宝可梦中心，jump shop等等，反正我是逛得很开心，虽然没买什么东西，但这样的地方哪个二次元能抵抗呢？带着妈妈逛了半天，最后其实还是有好些地方感觉没逛到，但是就已经要吃晚饭上晴空树了。妈妈恐高，所以让我自己上去。当天天气确实很好，之前来的时候还在想要不要将就着上去看看就得了，现在只庆幸当时还好没有上去，才能在这样一个能见度拉满的日子在晴空树上俯瞰东京。 东京晴空树的相关视频肯定有很多，我也不多费力介绍了。塔的电梯很有意思，四个电梯分别对应四个季节，可惜我上下都乘坐的是夏天主题的电梯。明明我喜欢的是冬天，怎么会这样。明明塔有那么高，电梯一下子就上去了，在里面也没有很明显的加速度的感觉，让人直呼厉害。塔上可以360度俯瞰东京夜景，明明小小东京，在塔上却让人不由得惊叹自己的渺小与人类的力量。但是人实在是太多了。。。基本上就只能跟着人流一点点往前走，没有往前走了再回头看看的选项。别的都很不错，下塔前我也去买了张明信片，这一路上我去过的地方都买了明信片，给自己做个纪念。要我评价一下的话，肯定是值得一去的，要是能避开人流的话就更好了。 第七天，已经是在日本的最后一天了，想去一去那些东京广为流传的城市与地点。于是上午首先去了银座，确实和新宿完全不一样，给人的感觉很现代，充斥着一股性冷淡风，各种大楼外的广告标牌也都是没听过的高端牌子。这一块有些马路也封起来作为之前提到的“步行者天国”供行人自由地穿梭。我们边走边看，就一路向北走到了皇居。顾名思义，是日本天皇居住的地方，本来做攻略的时候还看到可以进里面去参观，但一搜发现要提前两三个月预约，并且每天只放100个人参观，这100个还是加过量了的……不过当天实在是晒得不行，我们就简单沿着皇居走了走。皇居看着还是很大气的，位于土筑的高台之上，没有围墙但有护城河，外面的车好像也能开进去，只是不知道能开到具体哪个位置。 顺着护城河我们就走到了东京站，这个车站建得很好，也被视为是景点之一，可惜我们当时实在是太热了，车站人流量也很大，就没有怎么逛这个车站了，直接坐地铁朝着涩谷驶去。到了涩谷立刻被恐怖的人流淹没不知所措，本来想像之前去富士山时那样找个储存箱把行李放着，结果整个涩谷站那么大一片区域，我们能找到的所有储存箱都放满了。我们一合计，就走到了一站之隔的原宿站，这个地方可能不那么出名，但你如果玩《女神异闻录5》的话就肯定知道。原宿站一出站就有一条挤满人的竹下通行街，有着各色商品，光是看着就会觉得肯定受年轻人欢迎。我们弯弯拐拐终于找到一个全是投币储存箱的店面，还好，这里有很多空位。我们在放行李的时候我就跟妈妈说，要不我们也来这边投资个这种储存箱，人流量这么多，全自动赚钱。 放下行李后我们也去这个竹下通行街挤了挤，简单逛了逛，没买什么东西，一路就走回了涩谷站。来涉谷除了打卡以外，还有一个很重要的原因，这里有家商场在同一层同时开着任天堂中心，卡普空中心，Jump Shop，和宝可梦中心等，如果你不太清楚这些是什么，只需要知道任何一个玩家，日漫迷等对于这些地方都有着无法抵抗的吸引力。当然，这一块是我的私心，详细说来也没多大意思，我逛得非常开心。虽然一直觉得自己还没有什么买周边的实力，经济不允许，买回去也没地方放，所以没买什么东西，但只是在这种地方逛逛，看看官方出的各种周边，感受感受这种世界各地的爱好者因为热爱集聚一堂的氛围，就已经让我十分满足了。 出来后没走几步就到了那个传说中的，堪称地标般的涩谷路口，这个路口连名字都就叫“涩谷路口”，人流量大的难以想象。看着周围的人群，明显感觉到涩谷被称为“年轻人的天堂”不是胡说，不仅一眼望去都是年轻人，连路口各大广告牌都给人一种充满活力的感觉。简单打卡一下，我们就往之前看到的明治神宫去了，这一块非常的大，和代代木公园，代代木体育场连在一块，是东京市中心最大的一块绿地，供奉着明治维新的那个明治天皇。走过公园般的绿道到达神社本社中，还是能感觉到与其他小型神社的区别，明显会觉得更加大气，更加像我国的各种供奉建筑。神宫广场上可以自主投一点钱，拿一张信纸，写上自己的愿望，然后再写上姓名地址之类的资料以便神灵找到你，最后塞入信封，投到一个盒子里，算是为自己祈福。我和妈妈都写了各自的愿望，投了进去。 从神社出来后，我看到门口的小咖啡厅有卖抹茶冰淇淋，想起来到日本这些天一次抹茶也没有吃过，就进去要了一个香草味的一个抹茶的冰淇淋。实在是挺好吃了！不仅抹茶的好吃，香草味的更是出乎意料，可能是我冰淇淋吃得少，但确实是我吃过的最好吃的香草冰淇淋。我以前也吃过一次日本的抹茶相关甜品，甜口中茶的苦香却灿烂绽放成了主角，这次的抹茶冰淇淋也完全是我记忆中的味道，让人一本满足。吃完冰淇淋，就出发去在日本的最后一站了————三轩茶屋。 这个地方虽然在东京内也算是有点名头，但对于外地人来说大概也只是众多地区中的其中一个。但如果你玩过《女神异闻录5》，也就是俗称的P5，那一切就不一样了，这里被众多P5的玩家称为“素未谋面的故乡”，是游戏男主所寄住的咖啡店所在区域的现实原型————游戏里叫四轩茶屋，现实里就是这个三轩茶屋。所以以下内容有点同好向了，看不懂的话也没有办法。出了车站后我们先去吃饭，当然，我选择了咖喱饭。虽然味道十分一般，但毕竟是圣地巡礼，自然得做点应景的事儿。然后就是往传说中的卢布朗咖啡店，根据网上的攻略说搜索“千代の湯”一路走了过来，这个澡堂就是游戏里的澡堂，已经不营业了，卢布朗的原型就在旁边，是一家章鱼烧之类的店，Google Map上说是一个居酒屋，可惜当时也没有营业。只能悻悻拍个照，就往机场去了。至此，梦一般的七天真的要结束了。 我们最后还得在机场过一夜，很多像我们这么做的游客，所以基本上能躺的椅子上都躺满了人，我们好不容易找到两处能躺下。妈妈直接就睡了，我还在机场逛了逛。机场修的很漂亮，还有一座大桥，好像叫“日本桥”，记不太清楚了。总觉得这应该是一个一来日本就好好逛一逛的地方，而不是要离开才来到的地方。但谁又会把机场当作第一站呢？总归是有点遗憾的，机场别的地方也有很多看上去很有意思的商铺，但肯定都关门了，我也只能无趣地返回长椅，一觉睡到开放安检。匆匆拍了张照，就进去安检，等待上飞机了。 嗨呀，少年的欢喜呀，说尽三天三夜也好似说不干净。","permalink":"https://harlequinicecream.com/2023/08/20/ohmylalaland/","excerpt":"","categories":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/"},{"name":"生活","slug":"中文/生活","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/%E7%94%9F%E6%B4%BB/"}],"tags":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/tags/%E4%B8%AD%E6%96%87/"},{"name":"聊聊生活","slug":"聊聊生活","permalink":"https://harlequinicecream.com/tags/%E8%81%8A%E8%81%8A%E7%94%9F%E6%B4%BB/"},{"name":"旅游","slug":"旅游","permalink":"https://harlequinicecream.com/tags/%E6%97%85%E6%B8%B8/"}]},{"title":"年轻人的第一款提桶跑路","date":"2023-07-11T07:53:44.000Z","path":"2023/07/11/sarabauntouchabledreamland/","text":"逃跑，仓皇出逃。 甚至还有好多北京的景点没有去，连实习时间都差两天到3个月，实在待不下去了，仓皇跑走。 来北京的这三个月算的上是我少有的，称得上会后悔的事。说是这么说，但还是写下来点什么，和自己聊聊。 当时来北京的背景是我在只完成三个月的实习的时候给OPPO踢了，我还差三个月实习的坑得填上。但都tm三月份了，哪去找个实习填坑啊。当时我还挺心高气傲，那些实在没怎么听过的小厂还不高兴投简历。于是和百度，腾讯，还有些中厂拉扯了一个月后，唯一的收获是11篇面经。最后在好兄弟的帮助下，找到了学校的实验室挂名，可以回去摆烂三个月把任务搞定了。 当时已经基本决定了要回学校摆烂了，所以美团的二面都是面着玩的，但我估计那个时候他们很缺人，因为我入职一段时间后他们还是很缺人，所以连代码都没写，hr面都没面，就给我发offer了。最后我和我妈一合计，我妈答应帮我出6000一个月的天价房租，也算送我来体验体验生活，简历镀镀金。也就三个月，能有多糟呢，对吧？ 事实上在三个月要过完的时候回头看，就已经觉得糟的不得了了。除了在这里的同学和在牌店认识的几个朋友外，好像再也找不到什么能让我雀跃的事了。来到北京后，第一个月大概还算不错，正值无比短暂的，北京最好的季节。天气又好又凉快，虽然飞的柳絮（应该是吧）有点烦人，但我当时就觉得原来北京这么舒服。但很快一切好像就没那么好了，五一一过完，我就喜提二阳。北京作为人人嘴里“医疗资源超好”的地方，对于普通患者，尤其对于我这种时不时就跑医院，还没有北京医保的患者来说并不是十分友好。一挂号就是50，什么科室都得提前三五天，甚至一周挂号，要是突然有个什么事，只能挂70块钱的急诊号碰碰运气。 更别说过了刚来北京一个月的“蜜月期”，北京就开始了它的反人类气候。我在街上走着回住所的路上，突然觉得怎么看什么都有点不清楚。走着走着才意识到我有这么好运碰上沙尘暴了，肉眼可见的黄沙就在车灯的照射下在路口打转。到了六月，天气更是走向了过于极端的高温，原来同学说的“别看北京维度这么高，夏天比深圳还热”不是胡诌。什么样的笨蛋会在这种天气还出去到处跑呢？正是我这种珍惜在北京的日子的笨蛋。 原本计划对于北京气候的控诉只占这个博客的一小部分，居然已经写了这么多，甚至还有我糟糕的健康状况等待着哭诉。或许是水土不服，或许是干燥的气候，自从来北京后身体状态就不怎么理想。除了二阳，还有无尽的失眠，突发的感染咽喉炎等。针对我皮肤的一些例行治疗也只有极其糟糕的就医体验。医院电话永远打不通、整个科室周末只有一个医生、甚至没有护士我得自己往肚皮上打针、强制要求患者自己用家里的冰箱储藏药物等。难以想象，这就是所有资源堆砌出来的首都。 我想必须在这打住这部分的抱怨了，虽然这部分是我北京之行糟糕体验决定性的一部分，但终归不是我想聊的内容。我还是想把大头放在这极其糟糕的美团实习之旅上。 我赌没有美团的HR会看到这篇博客，看到了也不知道我是谁“糟糕”，甚至“极其糟糕”是从何而来呢。首先我得指出，我实习有280&#x2F;天的工资，外加1500&#x2F;月的房补，所以肯定会有人觉得我何不食肉糜。是的，我得承认从这方面来说，我有点不知好歹。但别急，先来听听我想要骂的是什么。 我已经跟不止一个同学，朋友吐槽过我在这里多么多么绝望了，所以这部分内容估计会大量使用我跟他们吐槽时用的原话，因为毕竟到现在我仍是这么认为的，没有一丝一毫的改观。 首先，这里基本符合我所有对“不想去的职场”的想象。逼仄的工作环境，连午睡时脚都伸不太开。傻逼的领导-&gt;纯种傻逼，不会好好说话，开口就是屌人，天天一副高人一等的姿态还一口一个“我和你们是同一战线的”。超高的工作强度，明面上写着要求在公司待满9个小时就可以，私下要求至少待满11个小时。事实上还不止，我导师就说活干不完，一般处于9105的状态。和王兴的母亲一样消失不见的福利，“开水厂”的外号不是白来的，是真的没有福利，主打一个把人当畜生。也不能这么说，我相信世界上所有把动物当员工的地方都有着比这里更好的福利制度。哈哈，这下恶性罄竹难书了。唯一的好事是我还没怎么感受到同事之间的勾心斗角，虽然那个傻逼领导喜欢抓着组里一个大哥欺负，不知道为什么。那个大哥对我还挺友善的，只能说那个领导脑子里至少一半的脑浆都化了脓。 最为令人难以忍受，让我说得出绝望二字的，是我在这里看不见丝毫自己的价值。在一个以剥削压榨外卖员与商家而闻名的企业里，在一个如此糟糕的职场环境下，我把自己对代码的热爱，把自己对这个我曾称之为“逻辑的艺术”的东西的所有信念转化成一些可有可无的弱智需求。这些需求的唯一价值，就是在这样一个超级人口大国当中，去寻找极其稀少的目标人群，并再从他们身上压榨价值。 这上面这一句话可能有点不好理解，也许这单独一段能解释一些东西。因为中国人实在是太多了，这就导致即使一个需求，let’s say一个功能，或是一个广告，只能命中一万分之一的用户，那也是非常多人了。再具体一点，如果美团外卖里现在突然多了一个“美团擦屁股”功能，可以叫外卖小哥到你家里给你擦屁股。即使这个功能十万个人里只有一个idiot会去用，每个用户能带来100块的价值，那美团就能得到，比如说，50万块的收入。而开发这个功能要多少成本呢？一个月薪三万的程序员，都不用一个月。 现在知道为什么美团内置原神了吗？知道为什么总说国产app“大而肿”了吗？ 而这就是我在做的。我每天上班就是在拉狗屎。我受了那么多教育，去了那么多地方，认识了那么多人，寒窗苦读16年，最后就是为了在北京五环外拉狗屎。 我这么对我的好兄弟说到。那你再想想那些北大清华的博士，人家还比你多寒窗苦读了不知道多少年，跟你在同一个地方拉狗屎，你觉不觉得好点？ 好兄弟这么回答我。 太悲哀了。太悲哀了。 碰巧那个时候胸怀大志，觉得人活着就是要改变世界，岂能郁郁久居人下，更何况在这种完全糟蹋人的价值的地方。当然现在我也想改变世界，只是托福太低了，连申请学校都没什么选择权，导致十分不得志。总之，没有办法想象我要在这样的地方燃烧完一生，只能仓皇出逃北京，回家做我的家里蹲了。 回家蹲着后失眠明显好转了，虽然睡眠质量还是不理想，但现在也有时间锻炼了，对人生充满了希望，感觉一切都在往好的方向发展。这让我想起来当时组里的唯一一个女生。尽管她的代码bug频出，那个傻逼tl还是对她好声好气，百般照顾。那个女生逃跑得比我还快，六月中就跑了。临走前bug也不改，消息也不回，请假也不说。最后见她是在我去食堂的路上，她满脸笑容，重新染了头发，在和别人打电话，感觉像是重生了一般。 再见，这不属于我的北京。","permalink":"https://harlequinicecream.com/2023/07/11/sarabauntouchabledreamland/","excerpt":"","categories":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/"},{"name":"生活","slug":"中文/生活","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/%E7%94%9F%E6%B4%BB/"},{"name":"学习","slug":"中文/生活/学习","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/%E7%94%9F%E6%B4%BB/%E5%AD%A6%E4%B9%A0/"}],"tags":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/tags/%E4%B8%AD%E6%96%87/"},{"name":"聊聊生活","slug":"聊聊生活","permalink":"https://harlequinicecream.com/tags/%E8%81%8A%E8%81%8A%E7%94%9F%E6%B4%BB/"},{"name":"学习","slug":"学习","permalink":"https://harlequinicecream.com/tags/%E5%AD%A6%E4%B9%A0/"}]},{"title":"我在成都郊区的景点买了杯奥利给奶茶","date":"2023-05-23T10:54:38.000Z","path":"2023/05/23/shittymiketea/","text":"我想了想，走进奶茶店。店里的边牧趴在窗边的椅子上听见有人进来，就看着我，我也看着它。 第一时间欢迎我的是只狗，而不是它旁边把腿翘在玻璃桌上，刷着抖音的奶茶妹。 我看了看店里的环境，很昏暗，可能亮着的只有收银台前的菜单牌，里面的菜单也已经发旧发黄变的凹凸不平。店里收银台以外的三个角都放着杂物，椅子箱子什么的，它们就堆在那里，好像这些东西本来就是被制造出来占空间的，堆放在那就是它们唯一的作用。 明明是国庆期间，却没几个人会路过这家店，更别说踏进这家足够破败的奶茶店。 我看了看菜单，停了两秒，说了句“给我拿杯奥利给奶茶。” 奶茶妹回头看了我一眼，好像有点意外，但也不是很意外。便把腿放下来，拖着脚上的鞋，啪嗒啪嗒地走向收银台后面的制作台。她弯下腰，把手伸进冰箱的下半层，将将遮住肚脐的短衣掀上去了一大截，露出那略带黄斑，看上去同她一般疲惫的后背。冰箱打开了但里面并不发光，她拿出一桶什么东西，放在台子上。 奥利给奶茶是屎做的吗？ 我很想问她。 但想到我一本正经地求知很可能最后会落为她瞪我两眼，把手里的桶狠狠放下，再说些什么话，最后大家都不开心我也灰头土脸的空手出去，就没有问。 虽然现在也不怎么开心，但她好歹还是一言不发地在做着我的奥利给奶茶。大桶里的东西被舀到奶茶的杯子里。没有什么声音，虽然本来也不会有什么声音，但我总觉得应该有些什么声音，像化学反应那样，毕竟两者的成分也不会差太多。现在我能听到的声音就只有勺子碰到桶时的声音，和店外飞驰而过的摩的声。 “不要冰。” 我才想起来我一贯的口味。 她没有回话，甚至没有任何动作上的停顿，我一时不知道她到底听到没有。但店里这么安静，我想至少她的狗狗听到了，那样也好。 我也不知道说什么好了，就看着门外的摩的一辆一辆过去，今天天气很好，外面阳光很明媚。但这和这家奶茶店又有什么关系呢？在这样一个下沉的奶茶店里，来往再多的摩的也不会有一辆特意停下来，走进这家悲伤的奶茶店，点一杯奥利给奶茶，甚至连阳光都只能止步于门外几米的距离。 但我会。我会在我大好的大学岁月中，在我人生最闪耀最激情的几个年头里，抽出一个国庆假期，来到这个鸟不拉屎的郊区景点，再走进这个可怜的奶茶店，从那张绝望的菜单里看到一个9块的奥利给奶茶。也只有我，会成为这只可爱的边牧生命里短暂的救星，帮它打破和女主人之间永恒的停滞。 奶茶妹把做好的奥利给奶茶“啪”的一声放在了桌子上，我才回过神来。看着那杯好像没什么特别的奶茶，我又开始重新思考那个问题：奥利给奶茶是屎做的吗？ 奶茶里确实没有冰，不过想起来才发现，可能只是因为这个奶茶店里根本没有冰块。奶茶的颜色和我见过的别的奶茶也没有什么不同，没有惊喜，也没有惊吓，好像也没有奥利给。奶茶妹把奶茶放下后就回到原来的位置，继续刷她的抖音了。边牧也把头转回了朝向门外的方向，看来逐客令已经下达了，你快走吧。 “9块钱对吧？” 我还是友好的确认了一下。不出意外的，我的声音又沉入了大海。我便也不再自找没趣，扫了码拿了吸管转身向外走去。 所以奥利给奶茶真的是屎做的吗？我最后斗胆喝了一口才知道，奥利给奶茶不是屎做的，它就是普通的，用奶精和茶粉勾兑的劣质奶茶，里面有一些呛人的，口感像是煤渣的粉末。可能是那家奶茶店的老板————或许就是那个奶茶妹，不甘于平庸的将其命名为“奥利奥奶茶”，便赋予了其“奥利给奶茶”这样一个惊世骇俗的名字。 显然，老板对平庸的不甘成为了一次成功的营销，吸引了同样不甘于平庸的我，冒着吃屎的风险，也要点上一杯奥利给奶茶。 最后我喝了两口就把它扔了，实在喝不下去。","permalink":"https://harlequinicecream.com/2023/05/23/shittymiketea/","excerpt":"","categories":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/"}],"tags":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/tags/%E4%B8%AD%E6%96%87/"},{"name":"瞎写写","slug":"瞎写写","permalink":"https://harlequinicecream.com/tags/%E7%9E%8E%E5%86%99%E5%86%99/"}]},{"title":"Handler私房菜","date":"2023-04-13T12:36:31.000Z","path":"2023/04/13/handlerMenu/","text":"首先，这篇文章会讲什么？ Android中的Handler机制，也被称为消息循环机制。它是干什么的，它由哪些东西组成，它是怎么运作的，以及面试会被怎么问。我尽力保证，通过这篇博客，配合给出的推荐文章，面试时handler相关问题就会是你的加分项。 我试着以最简单的语言去讲述我认为的最重要的东西，但这样难免出现不好理解的情况，这种时候就只能自己去搞明白了。 Let’s go then.Handler是做什么的？手机上一切你能看到的东西都是要系统去绘制的，如果多线程下，每个线程都可以绘制ui，会出现多个线程同时绘制同一个ui的不可控情况，这是不可接受的。 那我们为什么不加锁呢？ 太慢。UI需要以最快的速度绘制出来。 Handler就是为了解决这个问题，它让UI统一在主线程，有序的一个个绘制。具体来说，子线程通过持有主线程Handler的引用，使用主线程Handler进行UI绘制任务，实现子线程向主线程通信进行UI绘制。 听不懂？没关系，先往下看。 Handler机制成员在了解Handler的运作原理之前，先来看看是什么在支撑着整套系统。 作为一个共产主义者，我想要提醒您，就像接下来要讲的几个类支撑起了Handler机制一样，不要忘记是劳动人民支撑起了一切， 在这个部分，我会将整套消息循环机制比作一个流水线工厂，帮助尚未入门的我们更好理解各部分的作用。 现在想象一个工厂，有一个或多个窗口，将原材料放在一个盒子里从窗口送进去，这些盒子会被送到同一个传送带上，然后依次被同一个加工机器加工，最后被送回原窗口。 Handler。作为冠名整套机制的类，Handler就像这个工厂的窗口一样，往里面送入原材料，就会被加工好后送出来，再进行一系列的操作。 Message。流水线中的原材料不尽相同，但会被装在统一样式的盒子里。Message就是负责承载这些原材料的盒子。 MessageQueue。一开始说到这些装着原材料的盒子会被送到同一个传送带上，MessageQueue就是这样一个传送带，从它的名字上（消息队列）也能看出，这些Message会被送到这里来一个个被处理。 Looper。最后，传送带上的盒子（Message）会一个个被这台叫Looper的机器取走，加工，最后送回到它们被送进来的窗口。一条消息的循环就此完成。 文字难免抽象，看看图。 既然如此，我们只需要把主线程的窗口广而告之，所有子线程（再想象一下，这个流水线以外有许多工人，他们负责往窗口里送东西）就都可以通过向主线程的窗口里送消息了。也就是说，子线程可以向主线程通信，让主线程按照子线程的想法修改ui了。 Handler运行原理到了问题大头了，有了Handler机制的概念，那么它到底是怎么运作的呢？ 我想把重心放在Handler的原理上，但如果你连见都没见过这套机制在代码上要怎么使用的话，光听原理可能有点空中楼阁。所以我随便搜了一套代码，来展示Handler机制的使用。 （这套代码为了好看，我把它改的不太好运行，所以不要尝试跑它） 1234567891011121314151617181920212223242526272829303132333435363738394041424344public class HandlerAddThreadActivity extends AppCompatActivity &#123; private Button mButton; //一个要改变UI的按钮 private Handler mHandler; //主线程Handler @Override protected void onCreate(Bundle savedInstanceState) &#123; super.onCreate(savedInstanceState); setContentView(R.layout.activity_handler_add_thread); mButton = findViewById(xxxx); //实例化主Handler mHandler = new Handler(Looper.getMainLooper()) &#123; @Override public void handleMessage(Message msg) &#123; super.handleMessage(msg); //根据Message中的内容执行不同逻辑，比如改变mButton的文字 if(msg.what==1) mButton.setText(&quot;文案1&quot;); else mButton.setText(&quot;文案2&quot;); &#125; &#125;; //开启一个子线程 CustomChildThread customThread = new CustomChildThread(); customThread.start(); //子线程，用于处理耗时工作 public class CustomChildThread extends Thread &#123; @Override public void run() &#123; //通过让线程睡眠一秒，来模拟一个长耗时的任务 Thread.sleep(1000); //现在长耗时任务完成了，我们想通知主线程要去修改UI了 //在子线程中创建一个消息对象 Message childThreadMessage = new Message(); childThreadMessage.what = 1; //将该消息放入主线程的消息队列中 mHandler.sendMessage(childThreadMessage); //最后主线程Handler会处理这个Message，发现Message.what==1， //于是把按钮的文字改为&quot;文案1&quot; &#125; &#125;&#125; 现在，让我们再来看看谷歌到底是怎么实现这一套充满美感的机制的。（当我们说完postDelayed()方法后，你一定会明白为什么我说它”充满美感”） Message这里把Message放到第一个讲，是因为Message当中所有的属性都不依赖于别的类。换句话说，它只负责承载信息，而不实现功能。 不论是Handler，MessageQueue，还是Looper，他们实现的很多功能都要靠Message内部的属性实现。这里列出一些Message的属性，并简单解释一下它们都是做什么的。 如果你在Android Developer的官网上查找Message，会发现官网上Message的属性比起下面列出来的少了一些。事实上，官网只提供了对开发者可见的字段，但既然我们需要理解原理，自然不能止于这些。如果你有足够的好奇心，为什么不试着翻翻源码呢？ 12345678910111213141516171819// 用户自定义，主要用于辨别Message的类型public int what;// 用于自定义存储一些整型数据public int arg1;public int arg2;// 可放入一个可序列化对象public Object obj;// Bundle数据Bundle data;// 以下对开发者不可见// Message处理的时间。从系统开机开始算起public long when;// 记录这个Message是由哪个Handler发出的Handler target;// 当Message被处理后自定义的Runnable行为Runnable callback;// 指向MessageQueue中下一个MessageMessage next;...... 这部分比较好理解，要注意的都写在上面了。了解Message的内部结构，对于后面部分的理解有很好的帮助，比如其中的when，target，next，都是后面某些问题的答案。 我们在开头提到，Handler机制又称消息循环机制。那么现在消息有了，循环在哪呢？所以官方建议使用Message.obtain()方法去获得一个Message，而不是直接new一个，使用完之后再调用recycle()方法回收Message。上面那段代码对于Message的获取其实是不恰当的。 MessageQueue接着来看看将消息排成一列的流水线：MessageQueue，看看它有什么行为以及发挥怎样的作用。 MessageQueue的数据结构也不算复杂，甚至我们只需要讲一个属性，和两个方法。 一个属性：Message mMessages; 这个属性指向当前队头的第一个消息。所以，是的，MessageQueue其实并不是一个队列，它只维护第一个Message，后面的靠Message.next属性一个一个往后指。 什么情况，就看一个属性？是的，就看一个。其余属性基本都是负责某些功能的具体实现，主要是IdleHandler，Native阻塞机制，和同步屏障机制。这些在后面都会提及，吧。 两个方法：出队next()和入队enqueueMessage() 123Message next() &#123; final long ptr = mPtr; ..... 等等等等，别一言不合就上代码，让我先来试着简述一下。在队列里，next()方法会用一个死循环去调用队头的Message，如果这个Message的when属性，也就是这个Message应该被处理的时间，还没到的话，系统就会设置对应的堵塞时间去堵塞进程，最后进行一系列的处理（主要是和IdleHandler相关的）。 1234567891011121314151617181920212223242526272829303132333435363738394041Message next() &#123; ... // 阻塞时间 int nextPollTimeoutMillis = 0; for (;;) &#123; if (nextPollTimeoutMillis != 0) &#123; Binder.flushPendingCommands(); &#125; // 阻塞对应时间，（-1代表永久堵塞） nativePollOnce(ptr, nextPollTimeoutMillis); // 对MessageQueue进行加锁，保证线程安全 synchronized (this) &#123; final long now = SystemClock.uptimeMillis(); Message prevMsg = null; Message msg = mMessages; ... if (msg != null) &#123; if (now &lt; msg.when) &#123; // 下一个消息还没开始，记录需要堵塞的时间 nextPollTimeoutMillis = (int) Math.min(msg.when - now, Integer.MAX_VALUE); &#125; else &#123; // 获得消息且现在要执行，标记MessageQueue为非阻塞 //注意！！该mBlocked值为全局变量，在需要堵塞的场景下该值会被设为true（相关代码牵扯到IdleHandler的内容故省略） mBlocked = false; // 链表操作 if (prevMsg != null) &#123; prevMsg.next = msg.next; &#125; else &#123; mMessages = msg.next; &#125; msg.next = null; msg.markInUse(); return msg; &#125; &#125; else &#123; // 没有消息，进入阻塞状态 nextPollTimeoutMillis = -1; &#125; ... &#125;&#125; 有一点长，但其实也好理解。从队列里拿出第一个Message，看现在到不到时间执行，到时间就返回这个Message，不到时间就堵塞等待。 注意到当堵塞时间为-1时，代表着永久堵塞。那么为什么怎么做呢？什么时候唤醒呢？接着看。 说完出队的方法，再来看入队的enqueueMessage()方法。入队方法有两个参数，实际的写法是：enqueueMessage(Message msg, long when)。从参数名上也很容易看出来一个是要入队的消息，一个是Message应该被处理的时间。前文的Handler使用方法demo中，Handler去发送消息的sendMessage()方法，最后实际上调用enqueueMessage()方法去入队消息。 还是先简述一下入队方法的逻辑。根据Message的处理时间，也就是when属性，去从头遍历消息队列，找到这个消息应该插入的位置插进去，确保整个消息队列中的消息是按处理时间排序的。再看线程是否阻塞，阻塞的话就唤醒线程。这就对应了前面说的无限阻塞的场景。 12345678910111213141516171819202122232425262728293031323334353637383940boolean enqueueMessage(Message msg, long when) &#123; ... // 对MessageQueue进行加锁 synchronized (this) &#123; ... // 标记Message正在被执行，将消息需要被执行的时间赋给Message.when（在此之前该属性为空） msg.markInUse(); msg.when = when; // 用p记录当前队列头 Message p = mMessages; boolean needWake; // 判断是否需要唤醒MessageQueue // 如果有新的队头，同时MessageQueue处于阻塞状态则需要唤醒队列 if (p == null || when == 0 || when &lt; p.when) &#123; msg.next = p; mMessages = msg; //正如前文所说，mBlocked是全局变量，出队方法会改变这个变量的值。true代表正在阻塞，则需要唤醒。 needWake = mBlocked; &#125; else &#123; ... // 根据when找到插入的位置插入 Message prev; for (;;) &#123; prev = p; p = p.next; if (p == null || when &lt; p.when) &#123; break; &#125; ... &#125; msg.next = p; prev.next = msg; &#125; // 如果需要则唤醒队列 if (needWake) &#123; nativeWake(mPtr); &#125; &#125; return true;&#125; 其实写到这里，我感觉有点背离初心。将四个组件分开来讲我认为是不好的，这样虽然更有条理也更容易消化，但我更想要做一个Handler机制的串讲。可能这一部分得到后面面试的部分才能实现了，如果各位看官也觉得有点不成体系的话，建议先跳过具体的代码部分，通过我的简述形成一个大致的了解，把细节问题留到最后回头看。 LooperLooper的部分更好理解，关键方法也不多。正如前文所说，Looper负责不断从MessageQueue中不断取出Message，要注意的是每个线程有独立的Looper，主线程的Looper会自动准备好，而在子线程中要使用自己的Looper的话则需要调用Looper.prepare()方法初始化一个。 Looper.prepare()源码，简单看一下就行。 12345678910111213static final ThreadLocal&lt;Looper&gt; sThreadLocal = new ThreadLocal&lt;Looper&gt;();public static void prepare() &#123; prepare(true);&#125;// 最终调用到了这个方法private static void prepare(boolean quitAllowed) &#123; if (sThreadLocal.get() != null) &#123; throw new RuntimeException(&quot;Only one Looper may be created per thread&quot;); &#125; sThreadLocal.set(new Looper(quitAllowed));&#125; 顺便看一下Looper的构造方法。这个构造方法会同时new一个MessageQueue，并绑定当前线程。 1234private Looper(boolean quitAllowed) &#123; mQueue = new MessageQueue(quitAllowed); mThread = Thread.currentThread();&#125; 就像发动机需要点火来启动一样，一个Looper初始化完成后还需要调用Looper.loop()方法去启动这个Looper。 1234567891011121314151617public static void loop() &#123; // 获取当前线程的Looper与MessageQueue final Looper me = myLooper(); final MessageQueue queue = me.mQueue; ... for (;;) &#123; // 用一个死循环去不停获取消息队列中的消息 Message msg = queue.next(); // 可能造成线程堵塞 ... try &#123; // 调用Message对应的Handler（target属性）处理消息 msg.target.dispatchMessage(msg); ... &#125; ... &#125;&#125; 我把所有其余的代码都删了，只留下核心的方法，是不是难以相信的清爽？原来这么简单，就是在一个死循环里不停的获取Message，再分发到对应的Handler去处理。就是这么简单！ Handler终~~~~~~~于，来到了最后的大哥，Handler。前文讲的三个组件主要是在后台默默无闻的工作着，与程序员打交道最多的还是Handler。我们用Handler去操作Message，来实现线程之间的跳跃与交流。 注意到创建Handler时必须显示指明对应的Looper，如： 1Handler handler = new Handler(Looper.myLooper()) 对于Handler的操作主要是发送消息和处理消息，我们先从发送消息讲起。 发送消息的部分我不打算放代码上来了，主要是调用链比较长，每个函数内容又不多，建议参考源码。 发送消息最常使用的方法为sendMessage(Message msg)与post(Runnable r)，一个是直接发送消息，一个是讲Runnable包装进Message后发送。实际上这两个函数都是调用sendMessageDelayed(Message msg, long delayMillis)。这个函数从名字上可以看出，是实现延迟发送的功能，希望消息在delayMillis的时间后被处理。而前面两个函数既然没有说希望延迟多久发送，自然将delayMillis设为0就行了。在此之后会调用sendMessageAtTime(Message msg, long uptimeMillis)函数，在此之前的delayMillis会被加上系统的开机时间，从“希望延迟的时间”转变成“会被处理的时间”后发送给MessageQueue，消息队列再调用前文说过的enqueueMessage(Message msg, long when)，消息最后被发送到消息队列里。 最后整理一下调用链：sendMessage(Message msg)/post(Runnable r)-&gt;sendMessageDelayed(Message msg, long delayMillis)-&gt;sendMessageAtTime(Message msg, long uptimeMillis)-&gt;enqueueMessage(Message msg, long when) 处理消息的部分显得不那么重要，主要解决的问题是由哪一层去处理消息队列下发回来的Message。一段源码，一张图可解。 12345678910111213141516public void dispatchMessage(@NonNull Message msg) &#123; if (msg.callback != null) &#123; handleCallback(msg); &#125; else &#123; if (mCallback != null) &#123; if (mCallback.handleMessage(msg)) &#123; return; &#125; &#125; handleMessage(msg); &#125;&#125;private static void handleCallback(Message message) &#123; message.callback.run();&#125; 很简单，以*Message.callback（也就是post方法传进去的runnale对象）-&gt;Handler.callback-&gt;Handler.handleMessage()*的顺序一层层往下看，哪一层不为空就执行哪一层，流程图如下。 终~~~~~于，四大类都讲完了，虽然我自认为已经用了很简单的文字去讲述这些内容，但付出的精力和最后产出的效果好像都不尽人意。也许以后要重新思考一下博客产出的方式，能够输出一些内容，又兼顾到自身的精力限制。说白了还是太懒TT 至于前面一再说过的，我认为能称为亮点的，“面试会怎么问”的部分，我决定暂时搁置了。现在确实精力不够，等到后续我的面经整理完了，再把相关的部分更新上来。 好难呀，共勉。","permalink":"https://harlequinicecream.com/2023/04/13/handlerMenu/","excerpt":"","categories":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/"},{"name":"学习","slug":"中文/学习","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/%E5%AD%A6%E4%B9%A0/"},{"name":"Android","slug":"中文/学习/Android","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/%E5%AD%A6%E4%B9%A0/Android/"}],"tags":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/tags/%E4%B8%AD%E6%96%87/"},{"name":"Android","slug":"Android","permalink":"https://harlequinicecream.com/tags/Android/"},{"name":"人生DFS","slug":"人生DFS","permalink":"https://harlequinicecream.com/tags/%E4%BA%BA%E7%94%9FDFS/"}]},{"title":"我的卡牌人生","date":"2023-04-03T10:29:01.000Z","path":"2023/04/03/mycarrdgamelife/","text":"三月荒废，和各大厂小厂拉扯了一个月，点名批评腾讯，不想招人别招。 明明没几天就要去北京美团当骑手了，后面还不知道什么时候能回深圳，但脑子一热又进了个新坑，发现家旁边就有家牌店在做这个，还是跑过去和老板认识了一下。老板人很好，知道我没几天呆也消费不了几个钱还是很热情。巧的是这个老板以前还是腾讯的，说自己不想卷了跑出来的，现在顺着兴趣做卡牌，我也可以跟他吐槽吐槽面试的破事儿。 今晚闲来无事，聊聊我跟小纸片的渊源，以及我以难以想象的运气遇到的，对一无所有的我照顾有加的朋友们。 TCG卡牌开始之前先把这个说清楚，这里说的卡牌叫TCG（Trading card game）卡牌，集换式卡牌。核心就是一套牌几十张，玩家自己从很多很多的牌中选一些出来组成一套牌，然后对战。如果你听说过游戏王，那么就和它差不多，只不过我不玩游戏王，而是万智牌，ptcg, opcg等，主要是万智牌。 小胖，和三个学长我第一次接触到这些小纸片是在五年级左右，当时在楼道里总能捡到六年级在玩的万智牌。万智牌是一款背景在虚构的魔法宇宙下的卡牌游戏，那些精美的卡图，不明觉厉的规则，以及引人入胜的背景介绍语句把我拿捏的死死的。卡图就不放了，放几句背景来感受下（括号里是卡牌名）。 鹏洛客突袭队刚到新非瑞克西亚，便遭此处的时空防御打散：艾蕾侬早就知道他们会来。 (时空干扰) 罗佐司从其深海国度现身，潮浪为其意志而躬身行礼，海岸见其身形即畏缩奔逃。 （兴潮罗佐司） 这是随手找的两张牌，基本每张牌的背景描述都是这般引人入胜，再加上质量极高的卡图，这样的事物对当时的我简直就是降维打击。所以在某一天，我战战兢兢的推开了高年级同学常去的卡牌店的门，踏上了卡牌玩家的路。 牌店的老板是个胖子，所以大家都叫他小胖。明明是一群小学生初中生，却叫这样一个店长叫小胖，但大家都这么叫，所以我也跟着叫。小胖教了我万智牌怎么玩，给我组了我的第一套卡牌，因为当时预算只有四十块，现在看来那套牌弱的完全不能玩，但在当时大家的套牌水平都差不多的情况下，玩的倒也开心。更别说能玩上这样一个“很帅”的东西，真的是开心的不得了。 与（可能存在的）刻板印象完全相反的是，在那个店里玩的人都难以想象的优秀。有几个出手阔绰的，现在看来都觉得不可思议的高中生，现在不是在国外，就是事业有成。几个初中生也考上的都是深圳顶尖的高中，我嘛，也不差吧。三个学长是和我一个小区，一起长大的哥哥，也在打牌，我们有时候也会约着在某一个家里打牌，那段时间开心的不得了。现在三个人有两个在国外，一个不咋地，但都也在世界各地打着牌。 话说回来，小胖对每个人都很和善，能消费就消费，消费不了也没关系。我是不知道一个年轻人是要怎么做，才能和一群小学生初中生有说有笑的。当时我有点钱就砸在店里，后来我妈每次问我钱去哪了，我都回答买卡了，她就不让我玩了。但我还是去店里，每天逃掉学校的午休就去店里坐着。买瓶水买点小零食，玩玩偷偷买的手机，和小胖聊聊天，甚至是趴在桌上睡个午觉。后来逃午休的事给发现了，被一通狂骂。 最后小胖的店里打牌的人越来越少了，毕竟大部分是各种各样的学生，都在以各种方式往上走，在南山区的牌店最后总算是支撑不下去了，我也暂时退了卡牌坑。小胖不知道现在怎么样了，在倒闭前的几个月里他好像已经卖起了保险，可能现在就在卖保险吧。三个学长也一下就失联了，直到后面我高中毕业了，回坑后万智牌又把我们聚在了一起。 小七和小张再接触万智牌就是高中毕业了，终于也算是多了一点自由的空间。有一天突然就想起来了这个阔别四五年的爱好，于是搜了一下本地万智牌社区，发现深圳好像已经只剩一家牌店了。还好牌店不远，就抽一天去了店里，牌店的老板叫小七，我后面跟着别人叫他七爷。店里还有个店员叫小张，倒是没人叫他张爷，我也只好跟着叫小张，后来有人叫他张头，我也便叫他张头了。 小七在我大一的时候还是牌店的名义店长，也照顾了我许多，但在成都上学的时候群里传来消息说小七可能要回老家了，以后可能也就在有空的时候来店里看看。店上还举行了欢送小七的比赛，奖品都是店里玩的朋友们赞助的，十分丰厚。我自然没法去参加了，当时还挺伤心的，不过其实后面小七来店上的频率还挺高的，大概这就是电影理想中的大团圆结局吧。 小张人高马大的，但看得出来非常年轻，待人也非常和善。至今我也没想明白，也不知道到底修行到什么境界才能明白，要如何对每一个人都那么友善。刚到牌店那会没有认识的人，也有点尴尬，后来在牌店偶遇了上面说到的三个学长其中的一个，以及一些曾经在小胖店里认识的人，他们也很惊讶这么多年后居然还能再次相遇，我也在店里有了点立足之地。他们带着我和小张一起吃了顿饭，小张就能很亲切的对我了。一次吃完饭在回店里的路上小张突然说要跟我赌，赌某个人还在不在店上，就赌一瓶水。我当时都不觉得我们自己有这么熟，他就这样一下子拉进了我们之间的距离，以至于我一直都记得。 那瓶水后来我拿走了。 小张后来也离职了，但也常在店上出现，反而是我在牌店搬了几次家后就没怎么去过了。他现在不知道具体在做什么，但总是活跃在各种卡牌游戏的前线。要是能像他那样做着自己喜欢的事，也给自己搞口饭吃，那该有多好啊，现在想尽办法一个人整点薯条的我总是这么想着。 昆西和牛爷在我刚到成都那会，成都查得到的万智牌店有两家，一家店老板叫昆西，另一家老板叫牛爷。 我先去的店其实是昆西的店。昆西人很好，店上的人也很友善，虽然我一个学期都不一定去一次（主要是太远了），还是像朋友一样对我。不过就像之前说的，店面离学校实在是有点远，店上人也不是很多，后面就没怎么去过了。 昆西的店好像在这两年一直在搬迁，搬来搬去好像反而搬到我学校附近了。之前和两个牌友（有一个是姐姐）一起吃饭的时候去过店上一次，在吃饭的时候听说昆西家里做生意赔了，我猜十有八九是因为疫情，两万块就把店盘出去了，现在在努力还债。人民大抵总是无辜且可怜的，时代辜负了人民。 相比之下牛爷的店就离我学校近很多，还在我学日语的地方附近，自然和牛爷的接触就多很多。牛爷去年过了四十岁生日，不像是有老婆的样子，在我初来乍到的那会儿还有一份游戏设计的工作，现在全职做卡牌了。看得出来，和前面出现的人物相比，牛爷最大的不同就是这个年龄。牛爷就像一个受人尊敬的老大哥，但总也表现出年轻人一般的心态，在群里和大家说说笑笑，时不时蹦几句骚话，明明大家都叫他“爷”，却好像一点隔阂也没有。 牛爷店里活跃的人不少，以至于店里总有坐不下的时候，店里从高中生到博士到社会人士都有，我也不愿意和太多人有瓜葛，所以基本上还是和牛爷来往最多。 嗨呀，明明觉得备受照顾，可到嘴边又好像说不出个一二三了。可能上了大学就没法像以前那样一段时间天天跑牌店了，没能留下什么“对那段时间的美好记忆”。受到牛爷的照顾都是一件一件小事堆砌起来的，因此还是很感谢他，但又不太好挑几件拎出来说，也就只好作罢。 牛爷知道我现在在北京，让我回成都了跟他说声，要请我吃个饭，我也很期待。 柱哥柱哥是我三月在家待业时，脑子一热入新坑时发现的牌店老板，就在我家附近。但当时基本已经确定要去北京了，也是抱着一种很不好意思的心态去的店上，毕竟消费不了什么，甚至玩都玩不了几天。 柱哥知道了我的情况，也没说什么，反而是告诉我他之前在腾讯干了八年，可以看看有没有能帮我的。柱哥说他在腾讯干了八年，卷不动了出来的，做了卡牌相关八年，去年开的这个店，现在还在亏钱。我告诉他我这些年去过的牌店，告诉他我见过的深圳牌店好像混的都有点惨，也祝他生意兴隆。柱哥看得出来是没当过几年老板，在店里忙着打别的比赛的时候，看见我没事做玩手机还会带着歉意的来跟我说没法陪我打牌，因为店里很忙。 来北京的前一天我想去给柱哥道个别，却忘了那时也就是清明节前夕了，柱哥也开车回老家了。只能在微信上跟他打个招呼，听他说也在开辟万智牌赛道，我跟他说祝他生意兴隆，他让我下次回深圳再来玩。 回头看看，我对这些店员们老板们的感激之情大多来自他们明知我一无所有，还是把我像朋友一样热情相待。二十多年活下来，也见过不少对别人无比冷淡的家伙，并且好像随着年龄增长，进了大学，见识了职场，这样的人数量也跟着增加。索性大多数人都是好的，都向他人散发着不求回报的善意，我也得以从他们身上学到待人接事的技巧，在成长的路上留下开心的痕迹。 有点肉麻，像高中生强行升华的命题作文，所以虽然还想说点“这些小卡片承载了人与人之间的温情”一类的话，还是算了。但无论如何，时间需要具体的事物来承载，这些卡牌就是我的回忆与当今。","permalink":"https://harlequinicecream.com/2023/04/03/mycarrdgamelife/","excerpt":"","categories":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/"},{"name":"生活","slug":"中文/生活","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/%E7%94%9F%E6%B4%BB/"}],"tags":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/tags/%E4%B8%AD%E6%96%87/"},{"name":"聊聊生活","slug":"聊聊生活","permalink":"https://harlequinicecream.com/tags/%E8%81%8A%E8%81%8A%E7%94%9F%E6%B4%BB/"}]},{"title":"聊聊oppo，以及实习","date":"2023-03-02T06:30:22.000Z","path":"2023/03/02/fuckoppo/","text":"感谢好兄弟的照顾，有实验室去了，可以不用再烦这个东西了。这两天也开始调整调整心态，开始运动，并且来把坑填了。 从哪里说起呢，从找实习开始吧。 当时找实习的时候有点心急，其实也没什么急的必要，但性子就是这样想急着去找实习。当时那个时间点各大厂都还没开始招人，招的都是日常实习，也没几个hc，甚至准备时间也不够，还不愿意拿小厂练手，自然到最后没有多少好下场。 （话是这么说的，但我觉得当时面的很多家都不是真的在招人，纯纯完成kpi。有一通狂问一些莫名其妙的问题的蔚来，有电话面试里问的贼简单我答得基本完美然后就没了下文的tcl等） anyway，最后的结果就是OPPO都没什么要求，面的也很简单就把我放进来了。话说回来，本来就该简单点不是吗？你要的是实习生，还是大三的实习生，我还要咋样才算符合要求？我真的很讨厌面试考量的这种，背八股，刷算法的考察模式，都tm工作了，怎么还跟应试教育一样。 抱怨归抱怨，既然主题有“实习”，还是写写对找实习这件事的一些看法，也许能帮到什么人。 实习 简历从简历说起，不知道大家都是在哪写的简历，我是在超级简历上写的（百度搜就行）。模块化，有一些简单的模板，还算好使，但如果对模块都不太满意，这想修修那想改改，就没办法了。挑个简洁好看的模板，把个人信息都写好（问就是一开始姓名电话啥的都没写），最好有照片（去海马体好好照一张吧），学校拿得出手的可以贴个校徽，这些在超级简历的模块上都可以完成。 然后是教育经历，我就写了本科的学校和专业，然后是成绩。成绩自己斟酌吧，我专业课的成绩都还不错，但像微积分这种就很拉胯，所以我就只写了专业课的成绩。并且我们学校85分就是GPA4.0满绩，所以我就写GPA多少而不是百分制成绩多少。 简历嘛，就得造假，就得吹牛 接着是专业技能，就学校里学了啥就写啥呗，注意用词。我一开始写的是 “熟悉JAVA” ，辅导员说不能用“熟悉”，得用“掌握”。我改成“掌握JAVA”后又给学长看，学长说不能用“掌握”，得用“了解”。得，层层减码，最后我还是用的“掌握”，对NoSQL这种确实不怎么会的才写是“了解”。现在回头看来其实都还好，差不多都，自己斟酌一下。 之后我写的是项目经历，这点比较关键，但也很难说。因为据我了解，确实很多人没什么能拿得出手的项目，我是肯定有的写的，毕竟从大学以来就没歇下来过，有两个假期都在写项目，学校里的一门课刚好得我方向差不多，并且小组作业都是我写的（cnm我的某几个sb混吃等死的组员），就都能写上去了。辅导员说反正在学校做过的这样那样的项目，课程作业啊实验啊，都能往上写，如果实在没得写的，就这么做吧。写的时候注意写清楚自己做了什么，项目简介，有什么亮点。这些超级简历也有还不错的模块。 最后看心情可以写写语言成绩啊，自我评价啊（这个基本没人会看，属于凑字数的）之类的，凑够一页。如果前面已经满一页了这些就没什么必要了，尽量塞在一页内。写好的简历下载下来PDF，文件名写上自己的名字和岗位，冲！ 准备说真的。。我真的不想说准备就是上网查你这个方向的面经，看看都会问些什么，然后把人家的面经抄下来，看着去除一些很偏很怪的问题，然后一个个上网去查去背，但好像基本就是这样。太tm弱智了，当我把我这个想法说给滴滴的面试官后，他的建议是“先背了再说”，去你妈的。 把数据结构，操作系统，计网都翻出来复习一下， 但更多的，是在面试后总结自己哪里没答上来，以及哪里自己以为自己清楚，但其实并没有达到面试官的要求，需要进一步学习了解的地方。面试一般会有反问环节，没有也可以发问能不能评价一下自己这次面试，一般好的面试官都会回答你什么地方可能有问题。（这里点名批判sb腾讯的一面官，急着下班，问能不能评价也不理我，属于面了这么多次最令人恶心的一个） 刷题就不说了，随便写写吧，对实习生的算法要求都不会太高的，反正我没怎么被卡过。力扣hot100和剑指offer刷刷应该就够了。 对了，当被问到以后出国吗&#x2F;要读研吗&#x2F;能实习多久，一律回答不出国&#x2F;不读研&#x2F;可以实习很久，一直到毕业。见鬼说鬼话。 面试没啥可说的，注意礼貌这些也不用我说，每个人对怎么面试应该都有一套自己的框架。要说就是先面面小厂热热手，别浪费了大厂的机会。（多么痛的领悟） 要说就是别把面试官当朋友，不要像我一样跟那个滴滴面试官一通倾诉衷肠不仅丢了点好感度还让我觉得他很sb。多说点场面话，这基本就是踏入社会开始变得虚伪的第一步了，哈哈。 OPPO然后就要来说说，我在OPPO的这三个月。我一直在说，我认为我的实习体验是非常棒的，学到的东西是没几个人比得上的。 虽然岗位不太对口，但我不仅学到了做事的方式，学习新事物的方法论，还让我重新审视了一些以前一直秉承着的思维的正确性…总之学到了很多，让我试着去清晰的记录一下到底发生了什么。 首先说说我们的岗位当时在做什么，总的来说呢，就是在已有的手机内存结构上，去做一个架构层面的修改与优化。我们在做的是一个“创新型”的项目，没有什么前车之鉴给我们参考，我们能做的是先去了解清楚目前Linux在内存方面是怎么做的，我们从其中能不能得到某些启发，来为我们的目标服务。 我的老板是一个有点想到哪说到哪的人，刚上岗的时候他跟我说要学会“并行化处理”，后面又要我先把一件事做好再做下一件；给我的活验证了某个思路，又一时兴起叫我去写个专利…但他这样的行事风格我却觉得非常应该学习，特别是对于我这个年纪，或者对于刚进大学大一大二那会儿的孩子来说。简单来讲，就是要去“做”。如果有什么想法就去做，更active一点，没有什么好怕的，尤其是我们这种什么都不怕失去的年纪。 所以那段时间我又是捣鼓博客，又是学校工作室里疯狂指点江山，又是重写新生培养方案，脑子里这也想做那也想做。现在消停一点了，毕竟前段时间非常消沉，和那会儿振奋昂扬的样子完全相反。但肯定是有很多收获的，我的博客整起来了，工作室的工作也在持续跟进，还有很有趣的一点就是我开始试着说四川话了。我从小到大就会听人说四川话，但一直不敢开口自己讲，认为“自己不会说”。但其实没有什么不会的，Bunny来成都上一年学就敢说会四川话，语言这东西，过了自己心里一道坎，敢说就行了。所以大概什么事都差不多，讲究一个“要做”。 这周末和同学去香港看赛马，也是发现时间刚好撞上就觉得要去了，大抵也是“要做”的精神^ ^ 除此之外，我老板的个性签名叫“用爱优化”，也能从他日常言行举止看出来他确实很爱手上在干的事，进一步的，我开始反思自己一直以来对这个行业，或者说对自己人生一直以来的某些看法&#x2F;观念。 我是对读研没什么兴趣的，但我对在国内工作更没什么兴趣，所以一直想的是在美国找个就业好点的大学混个研究生，然后在那边工作。但我的老板今年34岁，刚评上专家，这就让我去重新回头审视，为什么他在这个年纪能评上专家，仍然向上走，但很多人在面临着那个，所谓的，35岁危机。 得出的结论就是热爱。之前在b站上看过一个寿司之神的纪录片（现在好像已经没有了），当时它的宣发语很有意思，叫“程序员一定要看的纪录片”。现在去看这个博客的about，会发现我写的是我希望我是“coder”，而不是“程序员”。这两个词是一定要分开的，而热爱与否就是救赎之道。读个研究生，或许就能给自己一个进一步寻找的时间与道路。 不过当我把这些讲给公司的博士朋友听后，他用“我觉得更多的其实就是个文凭，因为不论是研还是博基本是都是在给人打工”给了我一记闷棍。也ok，大概每个人都有自己的认识。 先写到这里，有什么想起来的再补充好了。好像每次一写都是长文，可能要改改某种写作习惯，分个上中下啥的，毕竟文章都是要给人读的。 对了虽然说fuckoppo但其实在oppo还挺爽的，弹性上班，每个月不管我请了几天假都发满钱。但我明确说了学校有六个月的要求，还是三个月就给我踢了，所以Fuckoppo。","permalink":"https://harlequinicecream.com/2023/03/02/fuckoppo/","excerpt":"","categories":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/"},{"name":"学习","slug":"中文/学习","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/%E5%AD%A6%E4%B9%A0/"}],"tags":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/tags/%E4%B8%AD%E6%96%87/"},{"name":"人生BFS","slug":"人生BFS","permalink":"https://harlequinicecream.com/tags/%E4%BA%BA%E7%94%9FBFS/"}]},{"title":"《数据压缩入门》简读","date":"2023-02-27T10:08:55.000Z","path":"2023/02/27/《数据压缩入门》简读/","text":"简简单单对Colt McAnlis写的《数据压缩入门》前几章有关无损数据压缩部分进行一个简读。不得不说我看的这本，图灵程序设计丛书，中国工信出版集团与人民邮电出版社出版的这本真有点臭，翻译有点问题，还总能看到错误。 信息，二进制编码，与香农的诅咒要讲怎么把数据压缩得更小，自然了解数据是什么，怎么样存在着。 信息在计算机中以二进制形式存在，这点不消多说。这篇文章中，作者默认读者有着一定的计算机基础，那么读者肯定知道生活中的十进制数是可以,且需要转化为二进制数存在计算机当中的。 但问题是，该怎么知道一个符号需要几个二进制位来表示呢？ “熵”这个概念在很多领域都有自己的应用，而在信息论里，香农给它的定义是这样的： 一个数的熵为该数对应的log2(n)的值。用来表示该数所需要的最少二进制位。 这是一个数字的熵，而对于一个数据集X的熵，定义是这样的： 看上去有点复杂？其实很简单，就是该数据集中，每个符号的出现概率，乘上这个概率以二为底的对数(lb)，求和后取相反数。 听上去还是晕乎乎的？没关系，知道有这个概念就ok了，更重要的是熵有什么意义。前面说一个数的熵是表示该数需要的最少二进制位，而一个数据集的熵就是该数据集中表示这组数据每个符号平均需要的二进制位数。打个比方 [A,B,B,C,C,C,D,D,D,D] 这样一个数据集，它的熵是-1.8455，意味着每个每个符号最少平均需要1.8455个二进制位来表示。 而在计算机当中肯定会和理论有所冲突，比如数字10的熵为3.321，计算机怎么能用3.321个位来表示一个数呢。所以便向上取整，用4个位来表示10。 并且假设我们在计算机中想存储一个10，则二进制形式则为1010，但计算机又怎么知道这是个”10”，而不是两个”2”（10）呢？ 不论是像这样取整的问题，还是避免歧义的问题，都是理论和实际的差距。香农用熵告诉我们，一个数据集的二进制大小是有限制的，最小也小不过它的熵。 真的是这样吗？我们明知山有虎，偏向虎山行，就要试着去打破这个魔咒看看。 统计编码VLCVLC(variable-length codes)，变长编码，的核心思想是根据符号在全文中出现的概率为其分配不同长度的编码。出现概率更大的符号就给予更短的编码，自然整体编码的长度就变小了。然后提供一个对应的编码表，就可以正确的逆向解码。 VLC进行编码时要注意不能产生歧义，故要使用编码的前缀性质，其中最著名最常见的方式便是霍夫曼编码。 根据概率模型去构建一个VLC时所用的工具称为统计编码，霍夫曼编码就是其中重要的一部分。但霍夫曼编码的局限性在于其最好情况出现在每个符号的出现概率都坐落在2的负整数次幂上，因为每次至少分配一个1或者0。 算数编码算数编码则提供了另一种解决思路，它将整个数据转换为一个很长的数值，根据每个字符出现的概率不断分段以编码。 形象一点来说，如果把整个数据视为一条绳子，每出现一个字符就根据其出现的概率减去固定长度的一段，剪到最后的一小段绳子就是最后编码完成的数据（这里的一小段在概念上是一个小数点后很多位的小数，计算机中会把小数点去掉，所以就成为了一个很长的数字）。而解码的过程就是把这条绳子剪掉的部分一截一截加上去。 ANS现在有一个更好的统计编码算法，被称为非对称数字系统（ANS）。说起来可能有点复杂，扔两张PPT试着理解一下，核心思想是围绕着一张表来逐位输出，压缩的原理也是“出现可能性越小的符号列高越低，逐位输出的二进制位数就越多”。 值得一提的是，当今最好用的两大压缩算法之一zstd算法，就使用了ANS。另 一个最好的压缩算法是lz4，在下文也有所介绍。二者在压缩速度与压缩率上各有千秋，但总的来说这二者都是从速度和压缩率上全面暴打了别的压缩算法。 自适应统计编码以上的内容都是基于“把整个数据看一遍，根据每个符号出现概率进行编码压缩”的思路上进行的，但实际上会出现“数据源源不断的流入，无法直接将其扫一遍”的场景。进一步的，符号在数据流中不同的部分出现的概率很大可能是不同的，一个符号可能在前一部分很少出现，但过了一会开始频繁出现，这种现象与计算机的局部性原理很像，书中被作者称为局部偏态 。 在这种情况下，若仍希望通过统计编码进行压缩，则所用的方法被称为自适应统计编码。 自适应VLC编码的思想与VLC基本相同，只不过要边读符号，边动态的计算该符号的出现概率，并动态的为其编码。如读入并输出了一个“B”后，发现“B”的出现概率超过了“A”，则将二者的编码进行对换。而解码时从头演变一次就可以了。 在自适应编码过程中也有可以额外操作的空间，比如编码过程中在需要的时候可以设置一个 RESET 重置标记来表示编码表被重置了，要从零开始建表，以此防止输出流的熵变得失控。 自适应算数编码和自适应VLC编码的思想基本是一样的，就不多说了。 字典转换以上都是“针对单个符号进行编码”的内容，但事实上很多符号经常组合在一起出现，比如英语中的单词。那么我们能不能利用这个性质呢？于是有了 字典转换。 大名鼎鼎的LZ算法就属于字典转换的范畴，介绍起来可能有点复杂，试着简述一下： 首先设置一个滑动窗口，并把这个窗口分为左右两部分。左边时已经处理过的搜索缓冲区，右边是待处理的先行缓冲区。这个窗口就在整个数据流中从左往右（从头到尾）滑动，然后有以下处理： 1.对于先行缓冲区的第一个字符，假设这里是字母X，从搜索缓冲区尾部开始寻找其第一个匹配。 2.若没找到，则输出&lt;0,0,X&gt;。若找到匹配，再去看先行缓冲区的下一个字符，看刚刚匹配的位置下一个字符是否依然匹配。如果不匹配了就再往前找，直到搜索到搜索缓冲区头部也没找到为止。如果依然匹配就再往下一个字符，重复到不匹配为止。也就是寻找最长的字符串匹配。 3.寻找最长字符串匹配完成后，输出找到匹配的位置以及匹配的字符串长度。 简单画个图： TOBEORNO | TOBEAAA 根据上述流程，匹配的最长字符串应该是“TOBE”所以会输出&lt;8,4&gt;,意味向前数8个字符后四个字符为匹配项。然后移动窗口到这个位置： TOBEORNOTOBE | AAA 这样的输出肉眼可见比原数据小得多，但更妙的是，这样的输出还可以通过VLC或别的方法进行进一步压缩。 上下文压缩另一种基于语境、上下文进行压缩的方法叫做 上下文数据转换。 我曾经想象的一种压缩方式看书时发现实际存在，叫做RLE。一言以蔽之就是： AAAAABBBCCCC -&gt; (A,5)(B,3)(C,4) 很好理解吧，但其中有消除歧义的问题需要解决，就不赘述了。 增量编码也好理解： (4,5,6,7,8,8,8) -&gt;(4,1,1,1,1,0,0,0) 通过加上前面一位来获得真实值。但这样简单的编码方式很多时候并不好用，于是出现了XOR增量编码，参照系增量编码等。更重要的是，经过这样转换的数据可以进一步进行压缩。 MTF（前移编码）和计算机里的局部性原理很像，认为出现过的字符很可能再次出现。所以维护一个有向列表，每出现一个字符就从列表中找到他的索引值并输出，再将这个字符移到列表头。 一个很有趣的算法，BWT，可以找出原数据的一种排列，让相同的符号更加靠近，这样就可以更好的进行压缩。这一行为通常被称为字典序排列。BWT肯定是可逆的（不然不就没有意义了吗），最常见的用法是将数据使用BWT转换后再使用MTF压缩（而不是RLE或LZ，这是有原因的！）。 LZ，RLE，增量编码，BMT都建立在一个假设上：数据的最佳编码方式与它的相邻性有关。 马尔科夫链虽然有着很玄学的数学定义，但马尔科夫链在实际层面上也是通过字符出现频率以推测概率，进而动态分配合适的码字。 比如通过对数据建模，发现如果前面是“hell”，那么下一个字符是“o”的概率高达百分之99，那么就可以给它分配最短的码字。 书中对马尔可夫链的评价非常高，原句是“如果不考虑一切其它因素，如时间成本等，那么最优的数据压缩就是个已解决的问题。” 但实际使用太复杂了，就简单的考虑hell后面接o的情况，就需要考虑到26的四次方种情况（每个字母后面都可能接26个字母中的其中一个，并且实际情况中还有各种符号，更加复杂）。所以实际中会使用更简单的方法，如PPM（部分匹配预测算法），或PAQ（上下文混合算法）。 最后简单做个书中压缩算法归类： 统计编码：VLC编码，算数编码，ANS，自适应统计编码（VLC,算数） 字典转换：LZ 上下文数据转换：行程编码（RLE），增量编码，前移编码（MTF），伯罗斯-惠勒变换（BWT） 马尔科夫链 适用场景： 静态VLC，算术编码：少量数据，复杂度更低 自适应…：大量数据或多媒体文件，以及更好的压缩率和运行时性能。 字典转换：位于“单词”的背景下的场景（但实际上LZ4在各种场景都基本表现很不错对吧） 增量编码：多用于数值型的数据。 RLE：适用于大量字符连续重复出现的场景。 MFT：相同符号集中的场景","permalink":"https://harlequinicecream.com/2023/02/27/%E3%80%8A%E6%95%B0%E6%8D%AE%E5%8E%8B%E7%BC%A9%E5%85%A5%E9%97%A8%E3%80%8B%E7%AE%80%E8%AF%BB/","excerpt":"","categories":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/"},{"name":"学习","slug":"中文/学习","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/%E5%AD%A6%E4%B9%A0/"}],"tags":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/tags/%E4%B8%AD%E6%96%87/"},{"name":"人生BFS","slug":"人生BFS","permalink":"https://harlequinicecream.com/tags/%E4%BA%BA%E7%94%9FBFS/"},{"name":"数据压缩","slug":"数据压缩","permalink":"https://harlequinicecream.com/tags/%E6%95%B0%E6%8D%AE%E5%8E%8B%E7%BC%A9/"}]},{"title":"《女生徒》 ——太宰治","date":"2023-02-11T07:01:47.000Z","path":"2023/02/11/女生徒/","text":"早上，睁开眼睛的心情是很有趣的。 好像玩捉迷藏时，动也不动地躲在漆黑的壁橱中，突然，嘎拉一声门被人拉开，光线倏地照射进来，然后听到对方大声叫道：“找到你了！”好刺眼，然后一阵怪异的感觉，心脏扑通扑通直跳，就像那种抓着和服前襟，略带羞涩地从壁橱里出来，然后气呼呼的感觉。不、不对，不是这种感觉，应该是更让人受不了的感觉。好像打开一个箱子，结果里面还有个小箱子，把小箱子打开，里面又有个小箱子，继续打开，又有箱子，再打开，还有箱子，然后，七八个箱子，全部打开后，才停止这没完没了的行为，最后出现了一个骰子般大小的箱子，轻轻地把它打开一看，里面却空荡荡的。有点接近这样的感觉。 说什么啪嚓睁开双眼，根本是骗人的。我的眼睛越来越混沌，就像淀粉渐渐往下沉淀般，然后一点点慢慢澄清，最后感到疲惫，整个人也为之清醒。早上，总感到有点空虚。难过的事不断涌上心口，让人受不了。讨厌！讨厌！早晨的我最丑陋不堪了。也许是没睡好的关系，此时的我两脚无力，什么都不想做。 说什么早晨有益身心，那根本是骗人的。早晨是灰色的，一直以来都是如此，是最虚无的。早上躺在床上，总是感到厌世，觉得讨厌，对各个丑行更是悔恨，甚至还闷郁到整个胸口梗塞，坐立难安。 早晨，真是可恶。 我小声地叫着：“爸爸！”感到一阵难为情，但又很开心。我翻起身，迅速叠好棉被。抱起棉被时，吆喝一声：嘿咻！突然间我想到，到目前为止，我从未想过自己是个会说出像嘿咻这般低俗字眼的女人。“嘿咻！”听起来好像老太婆在吆喝，真令人讨厌。为什么我会发出这样的声音呢？也许在我身体的某处，正住着一位老太婆。感觉真是不舒服，以后我可要多注意一些。这就像对人们低俗的走路模样大蹙眉头的同时，猛然发现自己也是这样行走般，教人万分沮丧。 早上，我总是毫无自信。穿着睡衣坐在镜台前，不戴眼镜看着镜子，我的脸庞有些模糊。虽然最讨厌自己脸上的眼镜，但眼镜却也有旁人无法了解的好处。我最喜欢摘掉眼镜眺望远处，整个世界变得朦胧，恍如梦境像万花筒般，感觉很棒。什么脏污都看不到，只有庞大的物体，鲜明强烈的光线映入眼帘。我也喜欢摘掉眼镜看人。人的脸庞，都变得柔和、美丽、笑容可掬。摘下眼镜时，我绝对不会想要和其他人发生争执，也不会口出恶言，只会默默地、茫然地发着呆。那个时候的我总觉得每个人都看起来很善良，会安于发呆，想要撒娇，心情也变得温和许多。可是，我也有不喜欢眼镜的时候。一戴上眼镜，脸部所带来的好感就会消失殆尽。从双眼衍生出的各种情绪，浪漫、美丽、激烈、软弱、天真、哀愁，一切均被眼镜给遮掩住，再也无法用眼睛挤眉弄眼地交谈。 眼镜是个妖怪。 我一直很讨厌我的眼镜，总觉得拥有美丽的双眸是最棒的。即使没鼻子，藏起嘴巴，看到那双眼睛，会让自己想要活得更好的眼睛，就会觉得很棒。我的眼睛只是大了些，没有什么用处，所以一盯着自己双眼看，就感到相当失望。连妈妈都说我两眼无神，可说是没有光彩的眼睛吧！一想到它像煤球，就觉得沮丧。因为这样，我觉得好惨喔！面对镜子，每每都深切地盼望它们能够变成湿润有光彩的眼睛、像碧湖般的眼睛，或像躺在青青草原上望着天空的眼睛，可以常常映出白云的流动，甚至连鸟的身影也都照映得清清楚楚。好想和拥有美丽眼眸的人相遇。 从今天开始就是五月了，一想到此，心里多少有些雀跃。很开心，因为夏天就快要到了。步入庭院，草莓花映入眼帘，父亲去世的事实，变得很不可思议。死亡、去世这种事最讨厌，实在让人难以理解，叫人纳闷。好想念姐姐、分开的朋友，还有好久不见的人。这些过去的事、前人的事，就像臭腌菜般环绕在我周遭，真是受不了。 恰皮、卡儿（因为是可怜的狗狗，所以叫它卡儿），两只狗一齐跑过来，并坐在我跟前。我只喜欢恰皮，恰皮的白毛光亮亮地很美，而卡儿却脏兮兮的。我在抚摸恰皮时，清楚地看到卡儿在一旁哭泣的表情。我也知道卡儿只有一条腿，但我就是不喜欢它那副悲伤的样子，就是可怜得让人受不了，所以我才故意不对它好。卡儿看来好像只野狗，什么时候会被抓去杀掉都很难说，它的脚都已经这样了，就算要逃，也跑不快吧！卡儿，请赶快到深山里去，因为谁都不喜欢你，还是早早去死吧！不仅是对卡儿，对人我也会做出恶劣的事，欺负别人、伤害别人。我实在是个惹人厌的小孩，坐在走廊上抚摸着恰皮的头，看到映入眼帘的绿叶，突然感到一阵难为情，好想坐在土地上。 我试着想哭泣。屏住气息，让眼睛充血，也许会流下一点泪来。我试着这样做，但还是没办法，也许我已经变成个没有眼泪的女人。算了。我开始打扫屋子，边扫边哼起《唐人阿吉》，稍回过神，惊讶于平常热衷于莫扎特、巴哈的我，居然也会无意识地哼唱《唐人阿吉》，这很有趣。拿起棉被时吆喝着嘿咻，打扫时唱着《唐人阿吉》，自己该不会已经变得非常糟糕了吧？再这样下去，不知道会说出怎样下流的梦话？我感到非常不安。不过又莫名地觉得很可笑，于是停下拿着扫帚的手，一个人笑了起来。 我换上昨天新做的内衣。胸口处刺有一朵小小的白蔷薇。上衣一穿上，就看不见这朵花了，所以谁都不知道。为此，我感到相当得意。 妈妈正忙着帮人做媒，一大早披头散发地出门去。从我小时候起，妈妈就常为别人的事尽心尽力，虽然我已习以为常，但还是对妈妈的精神感到讶异，深深佩服。也许是爸爸只专注于读书之故，所以妈妈连爸爸那一份也一起做了。爸爸早已疏于社交，但妈妈却不断地与善良的人们接触。虽然他两人个性不同，却能彼此敬重地相处。真是一对没有丑恶的美好又祥和的夫妇，啊！我觉得好骄傲好骄傲。 在酱汤温热前，我坐在厨房口，呆望着前面的杂树林。我发现以前也是这样，我总坐在厨房口，以同样的姿势，想着同样的事望着前面的杂树林。瞬间，莫名地想到过去、现在、未来。这种情形常常发生。 和某人坐在房里说话，视线往桌子角落的方向移动，然后静止下来，只有嘴巴在动。在这样的状态下产生了奇怪的错觉，觉得好像以前的什么时候，自己也曾在同样的状态下，谈论着同样的事，觉得以前看过这张桌子的角落。或是以前发生过的事又悄悄地、原封不动地来到自己面前。即使步行在很远的乡野小道上，我也一定会认为以前来过。步行时，我会顺手啪地摘下路旁的豆叶，然后想着，的确曾在这条路上把豆叶摘下。而且我相信，不管我走在这条路上多少次，自己都将会再把豆叶摘下。有一次洗澡时不经意地看着手，想到之后不管过了多少年，在洗澡时自己也会这么不经意地看着手，若有所感。一这么想，不知怎地，心情就沉了下来。 某天傍晚，把饭装到饭桶时，说是灵光乍现也有点夸张，但体内却有某种东西在咻咻地跑来跑去的感觉，该怎么说呢？我想应该是哲学的尾巴！可是一旦放任这些思绪，脑袋和胸口就开始变得透明，一种生命中轻柔地沉静，以一种搓揉凉粉时的柔软触感，慢慢地冲击着我，美丽而轻缓地扩及全身。此时，我并没有想到哲学的东西，只是有一种预感，觉得自己会像只贼猫一般，一声不响地活下去。这种感觉并不寻常，甚至很可怕。如果那样的感觉一直持续的话，也许会变成神灵附身那样。我想到了基督，不过，我可不想当个女教徒。 我想一切应该是因为我很无聊，没什么生活上的辛苦，无法处理每天所见的成百上千的感受，所以这些东西才趁我发呆的时候，幻化成妖怪，一一浮现出来吧？ 我独自坐在餐厅吃饭。今年第一次吃到小黄瓜，从青翠的小黄瓜可知道夏天来了。五月黄瓜的涩味中带有一种会使胸口空虚、刺痛、发痒的哀伤。 每次独自在餐厅吃饭时，就好想旅行，好想搭火车。看着报纸，报上刊登出一张近卫 [7] 先生的照片。近卫先生是个好男人，但我不喜欢他的脸，他的额头长得不好。我最喜欢看报上所刊登的图书文案。由于一字一行大概都要花上一百元、二百元的广告费，因此为使一字一句发挥最大的效用，人们都痛苦地绞尽脑汁挤出名句来。这样字字如金的文章，恐怕世上不多了吧！我莫名地感到心情愉快。 吃完饭，关好门上学。虽然觉得应该不会下雨，但因想带着昨天从妈妈那边要来的好雨伞，便把它带在身边。 这把雨伞是妈妈少女时代所使用的，发现这个有趣的伞面，我有些得意。好想拿着这把伞，行走在巴黎的街道。等到战争结束后，一定会流行这种梦幻般复古的雨伞，这把伞与女式外出帽应该很相配。穿上粉红色长裙、开着大襟领的衣服，戴着黑绢蕾丝长手套，在有着宽帽檐的帽子上别上紫堇花，迎着深绿的季节前去巴黎的餐馆吃早餐。然后忧郁地托着腮帮子，看着窗外川流不息的人群。此时应该有个人轻拍我的肩。耳畔瞬间响起音乐，玫瑰色的华尔兹。啊！好可笑！好可笑！可惜现实中只有这只老气奇怪的长柄雨伞。自己真是凄惨可怜，好像卖火柴的少女！总之，还是去拔草吧！ 出门时，稍微拔了一下门前的草，算是帮了妈妈的忙，也许今天会有什么好事发生也说不定。同样是草，为何会有被拔去的和放着生长的草呢？既然可爱与不可爱的草外形并没什么不同，为何一定要区分喜欢和讨厌的草呢？没什么道理。 喜欢或讨厌女人，这实在是太任性的观点。忙了十分钟后，我便急急地赶往停车场。穿过走道时，总是很想要写生。途中经过神社的森林小路。这是我新发现的快捷方式。走在林间小路上，不经意地往下看，小麦苗以两英寸的间隔到处生长。一看到青梗小麦苗，就知道今年军队来过这边。去年也有大批军队和马匹驻扎在神社森林里休息。过一阵子后来到这儿看看，小麦就像今天一样很快地生长。这些麦苗并不会再继续生长，今年这些同样从军队的桶子中掉落出的小麦，在昏暗的森林里，完全照不到阳光，煞是可怜，这样下去一定会死掉。 离开神社的森林小路，在车站的附近，我碰到了四五名工人。这些工人，一如往常对我说些口没遮拦的脏话，使我不知如何是好。虽然想超过这些工人先行离去，但若这么做，势必又得钻过他们之间的缝隙，与他们擦身而过，好可怕。不过，话虽如此，若只是站着不动，让工人先行离去，自己再保持一定的距离，还是需要足够的胆识。可是这样的行为有些失礼，也许工人们会感到很生气。我的身体开始战栗，几乎要哭了出来。我对这种哭泣感到很不好意思，勉强向他们笑了笑后，慢慢地走在他们后面。尽管那时候我只能这么做，但懊悔并未随着乘电车而消逝。真希望自己能早日对这些无聊的事淡然处之，变得坚强而美丽。 电车门附近有个空位，我把用具轻轻地放在那边，然后拉直裙摆，准备端坐下去。此时，有个戴眼镜的男人将我的用具挪开，整个人先坐了下去。 “喂！这是我找到的位子。”听到我这么说，男人只是一笑，便若无其事地看起报纸。仔细想想，真不晓得是谁厚脸皮，也许是我也说不定。 没办法，只好把雨伞和行李放到网架上，拉着皮革吊环，一如往常。想看杂志时，便用另一只手随意翻阅书页，想想事情。 若要让自己来选书的话，没有这类经验的我应该会因此哭丧着脸吧！我很相信书上所写的东西。开始阅读一本书之后，我常会沉溺其中，信赖、同化、共鸣甚至将之融入于生活之中。等到再阅读其他书时，我又立刻为之一变，呈现出另一种样貌来。窃取他人的东西，把它好好地改造成自己的东西，这种狡猾是我唯一擅长的才能。但我真的很讨厌这狡猾，每天重复着失败，真是可耻，也许以后自己会变得稳重些。不过，从这种失败中牵强附会地扯出道理，然后熟练地予以修饰，编出一套像样的理论，这似乎是悲苦戏剧所擅长的。（这句话好像在某书上读过。）我真不知道哪一个才是真正的自己。当读的书不见了，模仿的样本又找不着时，我会怎么办？也许我会手足无措，蜷曲着身子，胡乱地捂住鼻子。不管每天在哪辆电车里，都是这么胡思乱想，实在很糟糕！身体还残留着讨厌的余温，受不了。虽然我知道自己必须做点什么，一定得做些什么，但究竟怎么做，才能正确把握自我呢？以前的自我批判，实在没什么意义。批判后，一旦注意到讨厌的软弱部分，马上又对此感到心疼、怜恤，然后做出不必要的小题大做的结论，使得批判因而不了了之。看来，什么都不用考虑的，还是只有良心吧！ 这本杂志有个专栏叫《年轻女孩的缺点》，很多人投稿。阅读当中，有种好像在说自己的感觉，觉得好难为情。写的东西，根据各人不同而不同，平常觉得自己很笨的人，果然写出很笨的东西；看到相片会觉得很漂亮的人，就会运用美丽的字眼。真滑稽。我嗤嗤笑着读下去。宗教家会立刻提出信仰，教育家则自始至终提到恩惠、恩惠。政治家会用到汉诗。而作家，则大费周章地使用华丽的辞藻，自以为是。 尽管如此，里面所描写的都相当正确。没有个性、没有深度，甚至离正当的希望、野心都还有遥远的距离。总而言之，就是没有理想。就算有批判，也并未具有影响自己生活的积极性。没有反省。没有真正的自觉、自爱、自重，即使有勇气付诸行动，也无法担负所有结果的责任。虽然能顺应自己周遭的生活模式，巧妙地处理问题，但自己对生活却没有强大的热情，没有真正的谦逊、缺少独创性，只有模仿。缺少人类原本“爱”的感觉，就算装得高雅，却没有内涵。除此之外，杂志还提到了很多事。让人读了之后，不断地大口喘气，无法予以否定。 不过，这里所提到的全部言论都还算相当乐观，总觉得这些东西与这些人的心情还有些差距，他们只是写写而已。文中出现了“真正的”、“本来的”等形容词，但到底什么是“真正的”爱、“真正的”自觉，也许这些人知道，却没有刻意说明。若真是这样，如果他们能具体用一句话，权威地指示我们往左或往右，该有多好。因为我们已经看不见爱的表现方式，不说这不行、那不行，改以强硬的口吻命令这样做、那样做，对方反而照单全收。也许大家都没有自信。在这里发表意见的人，并非在任何场所都持这样的意见。尽管被斥责没有正确的希望、野心，但当我们要追求理想，付诸行动时，这些人该会在各处守卫我们，引领我们吧！ 我们隐约知道自己该去最好的地方，想去美好的地方、想去可以使自己一展才能之处。我们想要有好的生活。也正因如此，我们怀抱着正确的希望、野心。一想到得抱持着值得依赖、不为所动的信念，我的内心就感到急躁不安。不过，身为女孩，若要将这些东西具体实现在生活中的话，应还是需要相当努力。此外，还需要考虑母亲、父亲、姐姐、兄长的想法。（说归说，虽有点古板，但没有瞧不起人生的前辈、老人、已婚人士等人的意思，只不过觉得这些应置于第二顺位或第三顺位）有生活中常往来的亲戚，有认识的人，有朋友，还有总是用强大力量推动我们的“世俗”。一旦想到、看到、思考到这些所有的事，就不能再吵着要发挥自己的个性。 不特立独行，选择多数人走过的道路，持续前进，这才是最聪明的方法。将施予少数人的教育施予给大众，是件悲惨的事情。随着年龄增长，逐渐明白学校规定与社会习惯有着极大的差异。完全遵守学校的校规，会被人视作笨蛋，被说成怪人，被认为无法成材，一直贫乏下去。也许有不说谎的人吧！有的话，那个人铁定是个失败者。在我的亲戚当中，有个行为端正、抱持坚定信念、追求理想、试图活出自我的人，结果亲戚们全在说他的坏话，当他是个傻瓜。虽然明白被当成笨蛋就是失败，但在反抗母亲和亲戚之前，我却一直无法伸展自我意志。小时候，当我意见和大家不同时，妈妈就会问我：“为什么？”此时，若是我用一句话敷衍，妈妈就会非常生气地说：“坏孩子，品行不佳！”然后显出一脸悲哀的样子。妈妈也曾向父亲告状，父亲只是默默笑着。听说妈妈那时认为我是个“反常的小孩”。后来，随着渐渐长大，我开始变得战战兢兢。即使做一件衣服，也会考虑每个人的意见。 尽管偷偷喜爱符合本身个性的东西，想要去爱护，但就是没有办法清楚地表现自我。我总想要成为别人眼中的好女孩。许多人聚在一起时，总觉得自己好卑贱，扯着谎，聒噪地净说些不想说或背离本意的话。我很擅长这个。因为很擅长而觉得很反感。时代若能早点改变就好了，这样一来，自己就不会有这种卑屈的心情，不用为了别人的想法而战战兢兢生活了。 哎呀！那边的位子是空的。我从网架上拿下用具和伞，匆忙地挤进里面。右边是中学生，左边是背着孩子、穿着育婴服的太太。那位太太已上了年纪，脸上涂着厚厚的粉，头上用着时下流行的发卷，人还算漂亮，但喉咙的地方有些黑黑的皱纹，看来很凄惨的样子，让我觉得好讨厌，好想揍她。 人站着时与坐着时的感觉完全不同。一坐下来，就满脑子想着无意义的事情。我对面位子上坐着四五个年龄相仿、打扮得体的上班族。他们茫然地呆坐着，大概三十岁左右吧，全都很令人讨厌！都是一副睡眼惺忪的样子，毫无斗志。如果我现在对这些人之中的一位微笑的话，说不定单凭如此，我就会被拉去和那人结婚不可。女人决定自己的命运，单凭一个微笑就很足够了。好可怕，真是不可思议，我得要多留意。 早上总是想些奇怪的东西。突然很想念两三天前来家里整理庭院的园丁。他从头到脚都是园丁的打扮，但他的长相怎样都不相配。夸张地说，他有张哲学家一般的面孔，他的肤色是黑色的，眼睛很漂亮，眉毛也很威严。他的鼻子是狮头鼻，与黑肌肤很相称，看起来意志坚强，嘴唇形状也很好，只是耳朵有点脏。一看到手才又回过神知道他是园丁，但那张带着黑色遮阳软帽的脸实在让人觉得他当园丁很可惜。我曾向母亲打听三四次，问他是不是一开始就是个园丁？问到最后还被母亲斥责一番。 今天包着用具的包袱巾是那个园丁第一天来时，我向妈妈要来的。那天，家里在大扫除，修理厨房的工人、榻榻米的工人都来到家中，妈妈也在整理衣橱，我就在那时候看到这个包袱巾，把它要了来。这是一张漂亮的女用包袱巾，我觉得它很漂亮，把它打了结非常可惜。我这样坐着，把它放在膝上，看了好几次。我抚摸着它，好希望电车上的人能都看着它，可惜没人注意。只要能看一下这条可爱的包袱巾，要我嫁给他都无所谓。 想到“本能”这个字，我就好想哭。本能是我们的意志无法控制的。我渐渐地从很多事情上了解到这个道理，觉得自己几乎要发狂。该怎么做才好呢？我感到很困惑，不能肯定，也不能否定，只觉得头上似乎顶了一个好大的东西，拉着我走来走去。被拉着走让我有种满足的感觉，同时有种以悲伤的心情眺望别处的感情。为何我不能过着让自己满足，一生只爱自己的生活呢？看着本能腐蚀着以前的感情和理性，就觉得好难为情。在稍微忘掉现实的自我之后，我感到有些丧气。随着自我本能逐渐明朗，我有种想哭的感觉。好想呼唤妈妈和爸爸。不过，也许真实这东西就出乎意料地存在于连自己都很讨厌的地方，真是越来越难为情。 已经到御茶水站了。一到月台，所有的事就忘得一干二净。我赶忙回想刚刚发生的事情，但怎样都想不起来。再继续想下去，即使感到焦急，也什么都想不起来，脑袋一片空白。尽管当时我的心情是那么地激动，觉得痛苦、羞耻，但事过境迁，这些却又像什么都没发生过。此刻，我觉得很有趣。现在、现在、现在，就在掰着手指头计算的时候，现在，早已经远走高飞，而新的“现在”紧接而来。爬着天桥楼梯边想着这是什么东西，真是愚蠢。也许我是太幸福了也说不定。 早上的小杉老师很美丽，像我的包袱巾那般美丽。美丽的青色很适合老师，胸前火红的康乃馨显得很抢眼。如果她没有“假装”的话，我会更加喜欢这老师。她太装模作样了，似乎有些勉强，那样应该也会累吧！她的个性有些令人难以捉摸，好多我不清楚的东西，明明是性情阴郁，却要努力故作开朗。但无论如何，她还是个有魅力的女人，当老师有些可惜。尽管教室里没有什么人喜欢她，但我一直被她所吸引。我觉得她像是住在山中、湖畔古城的大小姐。讨厌，夸奖她了。小杉老师的话，为什么总是那么无趣呢？大概头脑不好吧！好可悲。从刚才开始就一直针对爱国心说个没完，那些事，难道还知道得不够多吗？什么不管怎样的人都有钟爱自己出生地的心情，真是无聊。庭院一角，有四朵蔷薇在绽放。一朵黄色，两朵白色，一朵粉红色。我呆望着花想：这真是个好地方。能发现花的美丽的，只有爱花的人。 午餐时候，提到妖怪的事。雅丝贝姐姐的第一高校七大不可思议事件之打不开的门，吓得大家哇哇大叫。我没有逃之夭夭，反而觉得十分有趣。由于玩得很疯，刚吃饱的肚子又饿了。我从安潘夫人那边拿了牛奶糖回来，发现大家已经沉迷在恐怖故事中了。每个人都对这些妖怪故事感到兴趣盎然，这对我们应该算很刺激的吧！接下来所讲的就不是怪谈，而是久原房之助 [8] 的故事，故事很奇怪。 下午美术时间，大家都到学校庭院上写生课。伊藤老师为什么老是折腾我呢？今天，老师要我当他图画的模特儿。我早上拿来的旧雨伞很受同学欢迎，大家都为之骚动，后来伊藤老师知道这事，便要我撑着伞，站在学校的一角，蔷薇的旁边。听说老师要画下我的姿态，然后参加这次展览。我答应只当三十分钟的模特儿。能帮人一些忙，让我很高兴。不过，与伊藤老师两个人面对面非常累人。他话一直说个没完，一堆谬论，未免也太关心我了吧！一面素描一面说话，谈得全都是我的事。我连回答也觉得麻烦，讨厌。他真不干脆。看到他这样奇怪地笑，明明是老师，却又表现得害羞怕事、不直爽的样子，真让我瞧不起。说什么“想起死去的妹妹”，真让人受不了。他人还好，就是动作太多了。 说到动作，因不服输，自己也做了很多的动作，而且我还很狡猾地故作姿态。实在太装模作样了，自己到最后也感到困扰。“摆了那么多的姿势，活像个做作的妖怪。”我这么说着，然后又摆了个姿势，一动也不动。一边替老师当模特儿，一边深深地祈祷自己能“做得自然些、纯真些”。别再读什么书了。只有观念的生活，故作无意义的高傲，真是让人轻蔑。你没有生活目标，实在该对生活变得更为积极些。老是摆出一副思索、烦恼自我矛盾的样子，其实一切只是自己太过伤感罢了，只是一味地怜惜自己、安慰自己而已。是你把自己给高估了！啊！内心这样污秽的我当模特儿，老师的画一定会落选，应该不会美丽。没办法，伊藤老师实在是个笨蛋，连我的内衣上有蔷薇花的刺绣图案都不知道。 沉默地摆着同样的姿势时，我突然非常想要钱，有十块钱日币也好。现在好想读《居里夫人》 [9] ，也希望母亲能长生不老。当老师的模特儿，真是辛苦，我已经筋疲力尽。 放学后，我和寺庙主持的女儿金子悄悄去好莱坞剪头发。剪好了一看，简直无法接受，我大失所望。怎样看都不可爱。好惨。我感到非常颓丧。来到这种地方，偷偷剪了头发，觉得自己好像一只有些肮脏的母鸡，现在非常后悔。我们来到这样的地方，简直是在自取其辱。 “就这样去相亲如何？”寺庙小姐非常兴奋，说了这样粗鲁的话。她仿佛产生了错觉，好像真的要去相亲一样。 她认真地问道：“这样的头发该插什么样的花？”“穿和服时，该配上哪种腰带？”真的是什么都没多想的可爱人儿。 “你要跟谁相亲？”我笑着问。 “有道是王八配绿豆啊！”她清澄地回答。 那是什么意思？我有些吃惊地听着。寺庙主持的女儿当然是嫁给管寺庙的人最好，一生都不愁吃。她这样的回答又让我大吃一惊。金子似乎完全没有个性，也因如此，她很像个女孩子。在学校她坐在我旁边，尽管我和她没那么亲近，但大家都认为寺庙小姐是我最好的朋友。她是个可爱的小姑娘，每隔一天写信给我，常常照顾我，实在非常感谢。可今天她这么夸张地兴奋，真让我讨厌。 和寺庙小姐分开后，我便搭上巴士，不知道为什么突然感到很忧郁。在巴士里，我看到了一位讨厌的女人。她穿着一件领襟很脏的和服，乱蓬蓬的头发上卷个发髻，手脚都很脏，还顶着一张男女难辨的红黑色脸庞。啊！真恶心。那女人有个大肚子，而且还不时诡异地奸笑。母鸡！我想到偷偷跑去好莱坞弄头发的自己，大概也跟这女人没什么两样。我想起早上电车上坐我旁边化着厚妆的太太。啊！好脏，好脏！女人真讨厌。正因自己是女人，所以很清楚女人的肮脏，就像晚上磨牙般地令人讨厌。那种肮脏，像玩弄金鱼后，那布满全身、怎么洗都洗不掉的鱼腥味，想到自己将这样日复一日散发着雌性体臭，真希望能在少女时就这么死亡。突然想生病，如果能患上重病，使得大量流下的汗水像瀑布般冲洗全身，身体因此变瘦的话，或许就能变得玉洁冰清。或许只要我活着，就怎样都无法逃离这样的命运。我渐渐能理解庄严的宗教意义。 下了巴士之后，稍喘了口气。巴士内空气污浊，直让人受不了。还是大地比较好，一踏上土地走路，就开始喜欢自己。我的身体变得有些飘飘然，像只极端快乐的蜻蜓。 回家的田间小路，实在看腻了，我已经不知那是个怎样宁静的田庄，眼前只有树木、道路、田地。今天，就让我试着装作初来这乡下的人吧！我是神田附近一个木屐匠的女儿，出生以来第一次踏上郊外的土地。这乡下到底看起来像什么呢？这是个很棒的构想，一个可怜的构想。我换了一个脸，故意夸张地四下张望。走在小并木路时，仰着头，眺望着新绿枝头，小声地“哇”。过土桥时，凝视着小河川，河水倒映着我的脸，我还模仿狗汪汪叫了几声。眺望远处的田野时，眯着眼，迎着风，心神荡漾。“真好！”我喃喃地叹息着，在神社稍作休息。神社的森林很黑，我慌慌张张地站起身，边说着“啊！可怕，可怕！”边缩着肩，急急忙忙地穿过森林。就在我对森林外面的光亮故作惊讶、觉得万物都很新奇、心无旁骛地走在乡下的道路上时，突然觉得好寂寞。最后，我试着轻轻坐在路旁的道路上。一坐在草地上，之前雀跃的心情唰地消失，猛然变得严肃起来。我安静地思考最近的自己。为什么这阵子自己变得这样差劲呢？为什么老是这样不安？我一直在害怕着某个东西。 最近有人对我说：“你越来越俗气了！”也许真是这样，我的确很糟糕、很无趣。“不行，不行。这样太软弱、太软弱了！”我大声地叫出来。“啐！”我大叫着，“想掩饰自己的软弱，是不可以的。振作，振作！”也许我在恋爱。 我躺在青草原上试着呼喊“爸爸”。爸爸，爸爸！晚霞的天空好漂亮，而且暮霭还是粉红色的。大概是夕阳光溶解渗透于暮霭之中，暮霭才会变成这样柔软的粉红色吧！粉红色暮霭悠悠地漂流，把我身体团团围住。发丝一根根静静地闪耀着微弱的粉红光芒，轻柔地碰触着我。天空也好美丽，我生平第一次想对天空鞠躬。现在我开始相信有神明存在了。天空的颜色该算什么色呢？蔷薇？火焰？彩虹？天使的羽翼？大佛院？不对，不是这样。应该要更庄严。 “我好爱这世界！”我热泪盈眶地想。注视着天空，天空慢慢改变，渐渐变成了青色。我不停地叹息，好想褪去自己的衣裳。就在这时候，树叶和草变得透明，已看不见它们的美丽，我轻轻触摸草地。好想美丽地活下去。 回到家，发现家里有客人，妈妈也在家里。依照惯例，客厅里传来热闹的笑声。只有我和妈妈两人时，不管妈妈的脸上有着怎么样的笑意，她就是不会发出声。可是与客人谈话时，就算脸上一点微笑也没有，她还是会高声大笑。打过招呼后，我立刻走到里面，在井边洗手，然后脱下鞋洗脚。就在这时，一个鱼贩走过来说：“久等了，鸣谢惠顾。”便把一条大鱼放在井边。是什么鱼？我不知道。不过鱼鳞很密，像是北海的鱼。把鱼移到盘子上后，我清洗双手，仿佛感觉到北海道夏天的腥臭。我想起前年暑假去北海道姐姐家游玩的情景。位在苫小牧的姐姐家，因为靠近海岸的关系，一直有鱼腥味。眼前清楚浮起姐姐傍晚一个人在空荡荡的厨房里，用白皙的手熟练地处理鱼的样子。那时候，我不知道为什么很黏姐姐，非常爱慕姐姐，可是那阵子姐姐才刚生下小年，没多余的时间顾及我。一想到此，便感觉冷风从空隙阵阵吹来，心中有一种无法再抱住姐姐的细肩，犹如死去般寂寞的心情。站在那个阴暗的厨房一角，我远远地忆起姐姐那白皙优雅的手指。过去的事情，往往令人怀念。说到亲人，真是个不可思议的东西，尽管对旁人的记忆会随着远离而渐遗忘，但对于亲人，却尽是思念与美丽的回忆。 井边的茱萸果有些泛红，也许再过两周就可以吃了。去年很滑稽。傍晚我一个人摘着茱萸吃时，恰皮静静地看着我，我觉得它很可怜，便给它一个茱萸，恰皮马上把它吃掉了。再给了它两个，恰皮又吃掉了。我觉得很有趣，于是便摇起茱萸树。当果子啪嗒啪嗒掉下来时，恰皮开始拼命吃茱萸果。笨家伙！这是头一只会吃茱萸的狗。我伸着身子，摘下茱萸吃。恰皮也在底下吃。真是滑稽！想到那时的事，就非常想念恰皮。 “恰皮！”我叫着。 恰皮从玄关急急跑过来。突然好想咬恰皮，疼爱恰皮，我用力抓住恰皮的尾巴，它轻轻咬着我的手。一种想哭的冲动袭来，我敲打自己的头，而恰皮此时正若无其事地喝着井边的水。 我走进房间点起灯，总觉得家中某处残留着偌大的空位，浑身不舒服。脱下内衣，换上和服，轻吻着内衣上的蔷薇花。坐在镜台前，对于客厅传来的哄笑声，我莫名地感到愤怒。妈妈和我两人的时候还好，可是只要有客人来，很奇怪地，她便会与我疏离，对我相当冷淡，像对待陌生人一般。这个时候，我就会很想念父亲，觉得很难过。 凝视着镜子，我的脸在镜中竟显得神采飞扬。这张脸仿佛是别人的，与我的悲伤、痛苦全然无关，自顾自悠然伸展着。尽管今天没有涂腮红，脸颊却显得红润，小小的嘴唇泛着红光，好可爱。摘下眼镜，我浅浅地笑着。眼睛也很好，清清澄澄的。大概是看了很久美丽的夕阳，才变成这样美丽的眼睛。真棒！ 我兴致勃勃地走到厨房磨米，顿时又感到悲伤。好怀念在小金井的家。心中燃烧起强烈的思念。在那个美好的家里，有爸爸、姐姐，妈妈那时也很年轻。每当我从学校回来时，都会和妈妈、姐姐在厨房或茶室聊些有趣的事。我会吵着要点心，不停向两人撒娇。有时我也会和姐姐吵架，被责骂后，便会一个人骑着脚踏车跑到很远的地方，等到傍晚回来，又再快乐地吃晚饭。那时真的很快乐。那时的自己一点都没有人际关系的困扰，可以尽情地撒娇，真好。就像在享受什么大特权，觉得心安理得，没有担心、寂寞，也没有痛苦。爸爸是个伟大的父亲，姐姐也很温柔，我总是依靠着姐姐。 但随着慢慢地长大，我开始变得令人讨厌，特权也突然消失，光溜溜的身子，好丑好丑。只要想到无法再对人撒娇，眼前便尽是苦痛。姐姐后来嫁了人，爸爸也离开了人世，只剩下我和妈妈。妈妈应该也很寂寞，这阵子妈妈说：“以后再也不会有生命的快乐了。看到你，我真的一点都不觉得快乐。请原谅我。你父亲不在，幸福也就不再来。”妈妈看到蚊子会猛然想到爸爸，脱衣服也会想到爸爸，剪指甲时、觉得茶很好喝时，也一定会想到爸爸。就算我再怎么体恤母亲的感受，陪母亲说话，但毕竟还是与父亲不同。夫妻之爱是世界最强大的东西，一定比亲人的爱还来得尊贵。我一个人煞有其事地想到脸颊泛红，用湿漉漉的手把头发绑起来。我咻咻地磨米，发自内心地觉得母亲很可爱，而且惹人怜爱，真想好好照顾她。后来我解开头发，觉得头发好像变长了。妈妈从前就很讨厌我留短发，如果把头发留长，好好地扎起来给妈妈看，她一定会高兴的。可是，我不喜欢做那样的事逗妈妈开心，觉得好讨厌。 仔细一想，这阵子我的局促不安跟妈妈有很大的关系。我很想作个妈妈心目中的好女儿，但我又很讨厌那样奇怪地讨妈妈欢心。如果我什么都不说，妈妈还是能清楚了解我的感受，且感到安心的话，该有多好。不管我多么任性，也绝不会成为世人的笑柄，就算觉得辛苦、寂寞，也会好好把握最重要的原则，爱妈妈、爱这个家。我很爱这个家，如果妈妈能绝对相信我，悠闲地生活的话，那我就心满意足了。我一定要变得了不起，要鞠躬尽瘁地工作。现在对我来说，这是我最大的乐趣。尽管把这视为我人生的道路，但妈妈却完全不信赖我，还一直把我当小孩子。只要我说些孩子气的话，妈妈就很高兴。这阵子我特地笨手笨脚地拿出四弦琴弹奏给妈妈听，妈妈像打从心底非常高兴取笑着：“哎呀！下雨了吗？听起来好像雨滴的声音。”想到自己认真弹奏四弦琴的样子，就觉得好惨，好想哭。妈妈，我已经长大了呀！世上的事情，我什么都知道，请放心跟我商量。家里的经济杂事，全部向我吐露。在这样的状况之下，若有什么要我帮忙的话，我绝对不会逃跑的。我很坚强。我会当个质朴、勤俭的女儿。真的！尽管如此，啊！突然想起有首歌叫《尽管如此》，便一个人咯咯笑了起来。回过神，只见两手呆滞地提着锅，像个笨蛋一样，东想西想。 不行、不行了，得赶快为客人准备晚餐。刚刚那条大鱼该怎么处置呢？总之先切成三片，抹上味噌吧！这样吃，一定很美味，做菜绝对要凭直觉。还有些黄瓜，可以用来做三杯醋。接下来是我拿手的煎蛋。然后，再做一道菜。 啊，对了！来做洛可可 [10] 。这是我自己发明的。把盘子上的火腿、蛋、芹菜、南瓜、白菜、菠菜这些厨房的剩菜全部集合起来，然后再按照颜色搭配，有技巧地排列。这既不麻烦，又很经济，尽管一点都不可口，但餐桌会被装饰得热闹华丽，看起来一副很奢侈豪华的样子。蛋的底下有芹菜叶，旁边火腿做成的红色珊瑚礁。白菜的黄叶子平铺在盘子上，既像牡丹花瓣，又像羽毛扇子。绿色菠菜，仿佛是牧场、湖水。把这样的两三个餐盘并列在餐桌上，客人应该会毫不犹豫地想到路易王朝吧！虽然没那么好，但既然我没办法做出美味佳肴，至少还能把菜弄得美观，让客人目不暇接，以此骗骗人。料理，外观是第一要项。我想这样应没问题了。不过这个洛可可，还是需要若干绘画天分。对于色彩搭配，若没有超乎常人一倍的敏感，是会招致失败的。至少必须具备我这样的纤细内心。最近查了一下洛可可这个字，它被定义为只有华丽，内容空洞的装饰样式。真好笑！这真是个好的回答。美丽之下，还会有什么内容吗？纯粹的美丽，总是没意义、无道德的。就是这么一回事。因此，我喜欢洛可可。 总是这样，当我做菜，到处尝味道时，总会莫名地有种虚无感。我疲惫地要死，心情很阴郁。所有的努力均达到饱和，已经不行了，已经无法达到更好了。我突然间感到厌烦，随便弄一弄味道、装饰，把一切搞得乱七八糟后，便一脸不高兴地端去给客人。 今天的客人特别忧郁，他们是大森的今井田夫妇和他们七岁的儿子良夫。 虽然今井田先生已年近四十，却像美男子般皮肤白皙，让人有点讨厌。为什么他要抽敷岛牌香烟呢？带过滤嘴的香烟，不知为何，就是让人觉得不太干净。香烟，不用带滤嘴，抽敷岛烟，会让人怀疑此人的人格。他将烟圈一个个吐向天花板，然后说着：喔、喔、原来如此。他现在好像是个夜校老师。 他太太个头很小，看起来唯唯诺诺，有些粗俗。就算没什么事，也会像笑岔气似的弓起身体，整个人趴在榻榻米上。有什么好笑的事吗？那样夸张地趴着大笑，不禁让人怀疑有什么高尚之处。在现今世上，这类阶级的人们大概就是最坏、最卑鄙的吧！这就是所谓的小资产阶级 [11] 、小公务员。 连小孩也在卖弄着无聊的小聪明，一点都不纯真。虽然这么想，我还是压抑着所有的情绪，鞠躬、笑、说话、摸着良夫的头说：“好可爱，好可爱！”这全都是欺骗大家的谎言，说不定今井田夫妇，还比我来得纯真呢！大家吃着我做的洛可可，称赞我的手艺，就算觉得寂寞、生气、想哭，还是得努力装出高兴的笑脸给他们看。终于我也可以坐下和大家一起吃饭了，但今井田太太聒噪无知的致谢却让我觉得好恶心。好！我不要再说谎了。“这菜一点都不好吃，只是黔驴之计罢了！”尽管我这样说出的事实，但今井田夫妇却拍着手大笑：“黔驴之计，说得真好啊！”我觉得好不甘心，真想摔出碗和筷子，大声痛哭。 看到我一直忍耐强装欢笑，妈妈也说：“这孩子越来越帮得上忙了！”妈妈！你明明了解我难过的心情，却为了迎合今井田先生而说出这种话，呵呵笑着。妈妈！实在不用那样讨好今井田这种人。面对客人时的妈妈，不是我母亲，她只是个弱女子。虽然爸爸已经不在了，但我们需要那么谦卑吗？一想到此就好难为情，什么话都说不出来。离开！离开！我爸爸是个优秀的人，为人体贴且人格高尚，若是因为我爸爸不在，就这么看不起我们的话，现在马上离开！我很想对今井田这么说，但我还是软弱地替他们服务，为良夫切火腿，帮今井田太太夹酱菜。 吃完饭后，我立刻躲进厨房，开始收拾，好想一个人独处。虽说用不着摆架子，但也没必要勉强地去迎合那样的人，和他们一起嬉笑啊！对那样的人礼貌，不不，连奉承都是绝对不需要的。讨厌！再讨厌不过了！不过，我还是尽可能努力了。想到妈妈，她不也对我今天忍着不耐烦，亲切服务的态度感到高兴吗？那样就够了。 不过，到底是强硬地清楚区分交际是交际、自己是自己，明确地对应事情、处理事物比较好呢？还是就算被人恶言相向，也绝不失去自我、隐藏本意比较好呢？我不知道哪个才对。好羡慕一些人可以终其一生地活在和我一样软弱、体贴、温和的人群中。什么辛苦都不用遭受，就可以毫不费力地过完一生，也不用刻意去追求任何东西。这样真好。 尽管压抑自己的情绪，为别人服务没有错，但如果以后每天都要跟刚才那样勉强自己去赔笑、附和今井田夫妇那种人的话，我可能会因此发疯。我突然想到，像我这种人是绝对不能够进监狱的。除此之外，连女服务生也当不成。我也不能当人家的太太。不，当妻子就不同了。如果已经彻底决定、有觉悟要为这人辛苦一辈子的话，不管多辛苦地工作，就算皮肤晒得黝黑，也能充分感受到生存的价值和生活的希望。即便是我，也能做到完美。这是理所当然的事。我会从早到晚，像只小白鼠般，不停地为他工作。我会努力地搓洗衣物，就像累积了很多的脏衣物般，再也不会有什么不愉快的事。因为我整个人会变得焦躁不安、像歇斯底里般怎样都静不下来，就算死也不瞑目，也要把所有脏衣物，一件不留地清洗干净、晾到衣架上后，才可以安然离去。 今井田先生要回去了。好像有什么事，妈妈也跟着一起出去了，还是应声连连地跟出去。今井田凡事都利用母亲，虽说只有这次没有，但我实在好讨厌好讨厌今井田夫妇的厚颜无耻，好想一拳打过去。将大家送至门口后，我一个人茫然地望着薄暮时的道路，此时突然好想哭。 信箱中有晚报和两封信。一封是给妈妈的，是松阪屋所寄来的夏季大甩卖的传单。另一封是顺二表哥寄给我的。 上面简单地写着他这次要调到前桥的军队，并向妈妈问好。即便是军官，也不能期待生活轻松，但我好羡慕那种每天严格、紧凑、规律的生活起居。我想，身体一直保持在井然有序的状态下，心情应该会变得较轻松吧？像我这样，什么事都不想做就什么都不做，干些什么坏事也无所谓，想要读书时又有无限的时间可以读书，说到欲望，又有很多希望想要实现。如果能给我一个从这边到那边的努力范围的话，不知道会对我的心情有什么样的帮助。狠狠地把我绑住，我反而会觉得感谢。 在战地工作的军人，他们的愿望只有一个，就是睡个好觉，不管哪本书，都是这么写的。不过，在我对士兵的辛苦感到同情之余，却也非常羡慕他们。从厌烦的、琐碎的洪水中抽离，只渴望着睡眠，那种状态，实际上是相当干净、单纯的。光是想，就有种爽快的感觉。像我这样的人，如果能被丢到军队生活好好地被锻炼一番的话，说不定会变成一个有话直说的可爱女孩。尽管如此，就算没有在军队生活过，但世上还是有像小新这样直率的人。 我实在是个糟糕的女孩、坏孩子。小新是顺二表哥的弟弟，虽说和我一样大，但却是一个非常乖巧的小孩。在亲戚中，不，在世界上，我最喜欢小新。小新，他眼睛看不见。想到他年纪轻轻却失明，不知道那是种什么样的感觉。在这样寂静的夜晚，他一个人待在房间里，又会是一种怎样的心情呢？ 像我们，就算寂寞，也可以通过读书、看夜景，多少打发一些时间，但小新却没有办法这么做。他只能沉默。他一直比别人多花一倍的努力读书，在网球、游泳方面也非常拿手。可是他当下的寂寞、痛苦又是个怎样的情形呢？昨晚，想到小新的事，上床后我便试着合上眼睛五分钟。即使是躺在床上闭着眼睛，也觉得五分钟很长，感到胸口郁闷。可是小新不论白天、晚上、几天、几个月，他都什么也看不到。如果他能发发牢骚、耍耍脾气、使使性子的话，我还会觉得比较高兴，可小新他什么都没说。我从没听过小新他发牢骚或对人恶言相向，不但如此，他还总是语带开朗，一副天真无邪的样子。那样子更加揪住我的心。 我边胡思乱想边打扫着客厅，然后烧洗澡水。在等洗澡水时，我坐在橘子箱上，点着微弱的石炭灯，把学校作业做完了。由于洗澡水还没滚，我便把《东绮谭》 [12] 重新读了一遍。书上写的事实绝不是什么恶心、肮脏的事，不过到处可见作者的装腔作势，让人有种老套、不可靠之感。也许是作者上了年纪的关系吧！但是，国外的作家，不管年纪有多大，还是会更大胆地撒娇、爱着对方。他们这样子，反而不会让人有讨厌的感觉。这部作品，在日本应该算是本好书吧！从作品底下可以深深地感受到真诚、淡泊，有种清爽的感觉，算是这位作家最成熟的一部作品，我很喜欢。我觉得这位作者是个责任感很强的人，由于他非常拘泥于日本的道德，因此反而故意表现出反抗之情，创作了许多令人忐忑不安的作品。这是情到深处者常会有的夸大表现，刻意地带上强烈的面具，结果反而使作品的个性转弱。不过，在这本《东绮谭》中有着寂寞的坚强，我很喜欢。 洗澡水开了。点亮浴室的灯，脱去衣服，将窗户全部打开后，我静静地泡在澡盆里，试着透过窗户窥视珊瑚树的绿叶，一片片的叶子，此刻因电灯的光线，正明亮地闪耀着。天上的星星闪闪发光。不管看了几次，都是闪闪发光。尽管我抬着头发呆，故意不去注意自己微微发白的躯体，但还是能恍惚地感觉到它确实存在于视线内的一隅。一沉默下来，逐渐发现它与小时候的白不相同，真叫我难以自容。肉体不理会自己的情绪，一个人自行成长，真是好难受，教我不知该如何是好。对于迅速成为大人的自己，我却什么也不能做，令人难过。除了听其自然，直盯着自己变成大人外，似乎已别无他法了。好希望身体能一直都像个人偶。 我试着学孩子那样将热水搅得哗啦哗啦地响，但心情还是倍觉沉重。渐渐地感觉到今后已没有活下去的理由，好痛苦。庭院对面的空地上，传来小孩哭喊的叫声：“姐姐！”我胸口一紧。虽然不是在叫我，但我却很羡慕那个被孩子所哭唤、依恋的“姐姐”。如果我有个会依赖我、会撒娇的弟弟，只要有一个，我就不会每天过着这种不像样的、彷徨的生活。我会干劲十足地生活下去，然后一生尽我全力宠爱着弟弟。不管再怎么艰苦，我都能忍受。我用力地想着，然后深深觉得自己很可怜。 从澡盆里站起身，不知为何，今晚特别想看星星。试着走到庭院，抬头一看，星星好像要掉下来的样子。啊！夏天快到了。青蛙在到处鸣叫，小麦也沙沙作响，不管抬头看几次，星星总是闪耀着。去年，不，不是去年，已经是前年了。当我吵着要去散步时，尽管爸爸人在生病，他也依然跟我一起出去散步。一直都很年轻的爸爸，他教我德语“你到一百、我到九十九”的小曲，告诉我星星的故事，即兴吟诗给我听，撑着手杖，噗噗地吐着口水，眨着眼跟我一起散步。真是个好爸爸！我默默地仰头看着星星，鲜明地忆起爸爸的事情。从那之后，过了一两年，我渐渐变成了坏女孩，有很多很多属于自己的秘密。 回到房间，我托着腮坐在桌前看着桌上的百合。好香！一闻到百合的香气，就算一个人倍觉无聊，也不会有肮脏的情绪。这朵百合是昨天傍晚散步到车站时在回家的路上从花店买来的。之后，我的房间像变了个样似的清爽许多，一拉开纸门，马上就闻到百合的香味。我不知道这会有什么样的帮助，但这样一直看着它，不管是在精神上还是肉体上，我都觉得自己比所罗门王 [13] 还要奢侈。我突然想起去年夏天的山形之旅。爬山的时候，我在山腰处看到一大片百合怒放着，内心大吃一惊，浑然忘我。但碍于山崖陡峭，怎样都无法攀登上去，就算自己再怎么被吸引，也只能静静地看着它们。就在那时，附近一位不认识的矿工默默地爬上山崖，唰！他摘来两手都抱不了的一大把百合花，然后，面无表情地将那些百合交给我。非常非常多的百合。不论是在多豪华的舞台还是在结婚典礼上，应该都没有人会拥有这么多的花。所谓因花朵而眩目，那时我才第一次体会到。当我两只手张开抱着那一大把纯白的花束时，我完全看不到前面。那位亲切的让我非常感动的年轻矿工，现在不知道怎么样了。虽然只有这样的机缘，但每当我看到百合时，一定会想起那位替我到危险的地方摘花的矿工。 打开桌子抽屉，翻了翻里面，我看到了去年夏天的扇子。白纸上有位元禄时代的女人放浪地随便坐着，在那旁边，有两行用青色酸浆所提写的字。去年夏天的经历，就像烟雾般，从这把扇子冒出来，山形的生活、火车内、浴衣、西瓜、河川、蝉、风铃。霎时间，我好想带着扇子去搭火车。试着将扇子打开，感觉上还不错。啪啦啪啦，扇骨松开，扇子突然变得很轻。就在我东玩玩西摸摸时，妈妈好像回来了。她的心情好像不错。 “啊！累死了！累死了！”虽然妈妈这么说，但脸上没有丝毫的不高兴。谁教她喜欢帮别人做事，这也是没办法的。 “真是一言难尽！”她边说着边更换衣服，然后进去洗澡。 妈妈洗完澡后，我们两人喝着茶，奇怪地嘻嘻笑着。妈妈像是想到什么似的说：“你前些日子不是说想看《裸足的少女》吗？如果那么想去的话，就去看吧！不过，你今晚得帮妈妈按摩一下肩膀。工作完再去，会更快乐吧！” 我高兴得不得了。我一直都很想去看《裸足的少女》这部电影，但因为这阵子我都一直在玩，心中便有所顾忌。妈妈发现了这点，于是就故意吩咐我做事，好让我能大摇大摆地去看电影。真的好高兴！好喜欢妈妈，想到这儿，我禁不住笑了出来。 好像很久没有和妈妈两人这样度过夜晚了。妈妈的应酬实在太多。妈妈应该也是不想被人小觑，所以才一直这么努力的吧！妈妈的辛劳仿佛传到我的身体里，我非常了解妈妈的疲惫。要好好保重啊！刚刚今井田来时，我还偷偷恨着妈妈，真是丢脸。我嘴里小声地说着：“对不起！”我总是只考虑到自己的事，对妈妈一直是娇纵又不讲理的态度。 每次妈妈不知道有多么痛苦，而我总是这么强硬地拒绝她。自从爸爸过世后，妈妈真的变得很柔弱。有时我会自己想道：“好苦！受不了！”然后整个人搂住妈妈，但一旦妈妈稍微靠在我身上时，却又觉得讨厌，好像看到什么脏东西一样。我真是太任性了。妈妈也好，我也好，我们同样都是弱女子。从现在起，我要满足于只有两人的生活，随时为妈妈着想，和她聊聊以前的事、爸爸的事，即使一天也好，我也要过着以妈妈为中心的日子，好好地感受生存的价值。虽然我总是将妈妈放在心上，去关心她、想作个好女儿，但在行动上、言语上，我却一直是个任性的孩子。而且，这阵子的我，像个孩子似的，连个可爱之处也没有，净是肮脏、羞耻的行为。 所谓的痛苦、烦恼、寂寞、悲伤，这些究竟是什么样的东西？具体而言，就是死。尽管我很清楚地知道现在这种感受，但要用一个字表现时，我还是无法说出一个类似的名词或形容词。就是感到忐忑不安，到最后，突然清醒，为之丕变。以前的女人，就算被骂说是奴隶、没有自我的蝼蚁之辈、人偶，但比起现在的我，她们还是非常具有女人天性，且心中宽裕，有着逆来顺受、坦然应对的睿智，她们知道纯粹牺牲自己的美，以及无报酬、全然奉献的快乐。 “啊！好个按摩师！真是天才啊！”妈妈又再戏弄我了。 “是吗？因为我很用心地在做啊！不过，我的厉害之处不只在于腰部上下的按摩喔。只有那样，就太没用了，我还有更厉害的地方喔！” 我试着直率地想到什么就说什么。这些话爽朗地在耳畔响起，这两三年来，我已经不再这么天真、干脆地说话了。在一番自我顿悟、释放之后，说不定会有平静的新自我产生出来，我高兴地想着。 今晚为了种种原因要向妈妈道谢，在按摩完后，我顺便为她念了点《Cuore》 [14] 。妈妈知道我在念这本书后，脸上露出总算安心的表情。前几天在我念《喀什尔的旋花》 [15] 时，她轻轻地从我这儿拿起书，看了一下封面后，脸色便显得相当凝重。不过她什么也没说，沉默地将书原封不动地还给我。当时我不太高兴，也就没有再继续阅读下去的心情了。妈妈应该没看过《旋花》这本书，但感觉上她好像知道里面的内容。 在寂静的夜晚，我一个人发出声音念着库尔的小说，当自己的声音非常大时，旁边还会有回音萦绕。念着念着，有时感到无聊了，便会对妈妈觉得很不好意思。由于四周非常安静，使得我的愚蠢变得相当突出。不管何时阅读库尔的书，小时候所受到的感动，还是依然让我心潮澎湃。想到自己的心还是天真美丽的，不禁感觉真好。不过念出声和用眼睛看实在有着不同的感觉，我在惊讶之余，便止住了阅读。然而，妈妈却在听到安利可以及加洛恩的地方时，开始俯首哭泣。我妈妈也跟安利可的妈妈一样，是个优秀美丽的母亲。 后来妈妈先行休息。因为一大早出门的缘故，她显得相当疲累。我替她铺着被褥，并啪哒啪哒地轻拍被褥的尾端。妈妈她总是一上床就合起眼睛。 接着我到浴室洗衣服。最近我有个怪癖，总是习惯在近十二点时才开始洗衣服。白天洗得哗啦哗啦的，总觉得浪费了时间，很可惜。不过，这也许正好相反也说不定。透过窗户可以看到月亮。我蹲坐着，一边洗着衣服，一边偷偷地笑着月亮。月亮一脸无知的样子。 我突然想到，在这相同的一瞬间，也许在某个地方也有可怜、寂寞的女孩，同样地边洗着衣服边偷偷地笑着这月亮。我相信她的确是在笑，她是位在遥远的乡下山顶上，于深夜静静地在后门洗涤衣服的痛苦小女孩。然后，在巴黎小巷的某间杂乱公寓的走廊上，也有一位和我同年的女孩正一个人悄悄地洗着衣服笑着这个月亮。我一点都不感到怀疑，就像真的从望远镜内看到一样，色彩清楚鲜明地浮现在眼前。谁都不知道我们的苦恼，如果我们现在立刻变成大人的话，我们的苦恼、寂寞说不定就会变得很可笑，一切只能追忆。可是，在成为大人前，该如何度过这段漫长讨厌的时间呢？谁都无法告诉我们。似乎只能置之不理，就像出麻疹一样。可是，也有人因麻疹而死、因麻疹而失明，放任不管是不对的。 尽管我们每天这样闷闷不乐，动不动就生气，但在这期间，因失足堕落造成无法挽回的遗憾，就此断算一生的却大有人在。甚至还有人心一横就自杀了。等到悲剧酿成之后，世上的人们就会很惋惜地说：“啊！如果再活久一点就会了解了，再更成熟一点，自然就会知道了！”然而就当事者的立场来看，我们可是好痛苦、好痛苦地熬到那个时候。我们拼命努力侧耳倾听，试图从这世上获取某些东西，反复地记取不痛不痒的教训，唉、唉地自我安慰，但我们就是常犯着可耻的过错。我们绝不是享乐主义者，若遥指着那遥远的山峰，说着走到那边会有好风景的话，我们一定会照着去做，我们知道那绝不是谎言。可是此刻我们的肚子却是非常疼痛，对于腹痛，你就算看到也会视而不见，然后告诉我们：“喂喂，再忍耐一下，能爬上山顶的话，就会好了。”一定是有人搞错了，最坏的是你。 洗完衣服，将浴室扫一扫，我悄悄地拉开房间的纸门。一拉开门就闻到百合的香味，好清爽，连内心深处都变得透明，有种崇高的虚无感，真是一个好装饰。当我静静地换上睡衣时，睡得香甜的妈妈突然闭着眼睛说起话来，我吓了一跳。妈妈时常会做出这样的事让我感到讶异。 “听到你说想要双夏天的鞋子，今天到涩谷时，我就顺便看了一下。鞋子好贵喔！” “没关系啦！我没那么想要。” “可是，没有的话，会很烦恼吧！” “嗯！” 明天，又是同样的一天。幸福，这一生都将不会来吧！这我明白。不过，还是愿意相信它一定会来，明天就会来，我要带着这个信念睡觉。我故意大声地躺在棉被上。啊！真舒服。因为棉被冷，所以背部感到一阵寒意。我突然感到一阵恍惚，朦胧地想起“幸福迟了一夜才来”这句话。等待着幸福，后来终于按捺不住地跑出家门。隔天，美好的幸福讯息终于来到这个已被舍弃的家中。已经太迟了！幸福迟了一夜才来。幸福是…… 庭院中传来卡儿的脚步声，啪哒、啪哒、啪哒、啪哒。卡儿的脚步声是有特征的，由于它的右前脚比较短，前脚是呈O型的螃蟹状，因此脚步声中总带有些许的寂寞。它常在这样的深夜徘徊在庭院之中，究竟是在做什么呢？卡儿真可怜。虽然今天早上捉弄了它，但明天我会好好疼爱它的。 我有个悲伤的毛病，若不将双手紧紧地盖在脸上，我会睡不着。我盖着脸，一动也不动。 快要睡着时的心情，是很奇怪的，就像鲫鱼、鳗鱼用力拉扯钓线般，总觉得有一股很重的、像铅一样的力量透过钓线在拉扯着我的头。一用力拉，我就迷迷糊糊地睡去，稍稍放松线，我又突然恢复了精神。再用力拉，我又迷糊睡去。然后再放一些线。重复个三四次之后，开始被大力拉起，然后一觉到天亮。 晚安！我是一个没有王子的灰姑娘。明天，我会在东京的哪里呢？您知道吗？我们将不会再见面。","permalink":"https://harlequinicecream.com/2023/02/11/%E5%A5%B3%E7%94%9F%E5%BE%92/","excerpt":"","categories":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/"}],"tags":[]}],"categories":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/"},{"name":"生活","slug":"中文/生活","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/%E7%94%9F%E6%B4%BB/"},{"name":"阅读","slug":"中文/阅读","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/%E9%98%85%E8%AF%BB/"},{"name":"学习","slug":"中文/生活/学习","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/%E7%94%9F%E6%B4%BB/%E5%AD%A6%E4%B9%A0/"},{"name":"学习","slug":"中文/学习","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/%E5%AD%A6%E4%B9%A0/"},{"name":"Android","slug":"中文/学习/Android","permalink":"https://harlequinicecream.com/categories/%E4%B8%AD%E6%96%87/%E5%AD%A6%E4%B9%A0/Android/"}],"tags":[{"name":"中文","slug":"中文","permalink":"https://harlequinicecream.com/tags/%E4%B8%AD%E6%96%87/"},{"name":"瞎写写","slug":"瞎写写","permalink":"https://harlequinicecream.com/tags/%E7%9E%8E%E5%86%99%E5%86%99/"},{"name":"聊聊生活","slug":"聊聊生活","permalink":"https://harlequinicecream.com/tags/%E8%81%8A%E8%81%8A%E7%94%9F%E6%B4%BB/"},{"name":"年终总结","slug":"年终总结","permalink":"https://harlequinicecream.com/tags/%E5%B9%B4%E7%BB%88%E6%80%BB%E7%BB%93/"},{"name":"聊聊生活，年终总结","slug":"聊聊生活，年终总结","permalink":"https://harlequinicecream.com/tags/%E8%81%8A%E8%81%8A%E7%94%9F%E6%B4%BB%EF%BC%8C%E5%B9%B4%E7%BB%88%E6%80%BB%E7%BB%93/"},{"name":"旅游","slug":"旅游","permalink":"https://harlequinicecream.com/tags/%E6%97%85%E6%B8%B8/"},{"name":"学习","slug":"学习","permalink":"https://harlequinicecream.com/tags/%E5%AD%A6%E4%B9%A0/"},{"name":"Android","slug":"Android","permalink":"https://harlequinicecream.com/tags/Android/"},{"name":"人生DFS","slug":"人生DFS","permalink":"https://harlequinicecream.com/tags/%E4%BA%BA%E7%94%9FDFS/"},{"name":"人生BFS","slug":"人生BFS","permalink":"https://harlequinicecream.com/tags/%E4%BA%BA%E7%94%9FBFS/"},{"name":"数据压缩","slug":"数据压缩","permalink":"https://harlequinicecream.com/tags/%E6%95%B0%E6%8D%AE%E5%8E%8B%E7%BC%A9/"}]}